[Timeout] BlockStatement
simple-viewer/src/utils/TreeTransform.ts:4:43
 import { Model } from "../dto/Model"
 
 export const buildTree = (models: Model[]) => {
-  const treePaths = models.flatMap((x) => {
-    const path = getNormalPath(x)
-    const pathArray =
-      path.indexOf("/") > 0 ? path.split("/") : path.length > 0 ? [path] : []
-    const transformed: string[] = pathArray.map((pathElem, index) =>
-      getPath(pathArray, index + 1)
-    )
-    transformed.push(path + "/" + x.name)
-    return transformed
-  })
+  const treePaths = models.flatMap((x) => {})
   const uniquePaths = [...new Set(treePaths)].sort((x, y) => x.localeCompare(y))
   const tree: Model[] = uniquePaths.map((path, index) => {

[Killed] EqualityOperator
simple-viewer/src/utils/TreeTransform.ts:7:7
   const treePaths = models.flatMap((x) => {
     const path = getNormalPath(x)
     const pathArray =
-      path.indexOf("/") > 0 ? path.split("/") : path.length > 0 ? [path] : []
+      path.indexOf("/") <= 0 ? path.split("/") : path.length > 0 ? [path] : []
     const transformed: string[] = pathArray.map((pathElem, index) =>
       getPath(pathArray, index + 1)
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 12
+ Received  +  2

@@ -1,23 +1,18 @@
  Array [
    Object {

[Killed] ConditionalExpression
simple-viewer/src/utils/TreeTransform.ts:7:49
   const treePaths = models.flatMap((x) => {
     const path = getNormalPath(x)
     const pathArray =
-      path.indexOf("/") > 0 ? path.split("/") : path.length > 0 ? [path] : []
+      path.indexOf("/") > 0 ? path.split("/") : true ? [path] : []
     const transformed: string[] = pathArray.map((pathElem, index) =>
       getPath(pathArray, index + 1)
killedBy: buildTree tests one node tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

  Array [
    Object {
+     "id": 1000,

[Killed] ArrowFunction
simple-viewer/src/utils/TreeTransform.ts:8:49
     const path = getNormalPath(x)
     const pathArray =
       path.indexOf("/") > 0 ? path.split("/") : path.length > 0 ? [path] : []
-    const transformed: string[] = pathArray.map((pathElem, index) =>
-      getPath(pathArray, index + 1)
+    const transformed: string[] = pathArray.map(() => undefined
     )
     transformed.push(path + "/" + x.name)
killedBy: buildTree tests simple tree
statusReason: TypeError: Cannot read properties of undefined (reading 'substring')

[Killed] BlockStatement
simple-viewer/src/utils/TreeTransform.ts:30:41
   })
   return tree
 }
-const getNormalPath = (model: Model) => {
-  return model.path.trim().startsWith("/")
-    ? model.path.trim().substring(1)
-    : model.path.trim()
-}
+const getNormalPath = (model: Model) => {}
 
 const getPath = (pathArray: string[], index: number) => {
killedBy: buildTree tests simple tree
statusReason: TypeError: Cannot read properties of undefined (reading 'indexOf')

[Killed] BlockStatement
simple-viewer/src/utils/TreeTransform.ts:36:57
     : model.path.trim()
 }
 
-const getPath = (pathArray: string[], index: number) => {
-  return pathArray.slice(0, index).join("/")
-}
+const getPath = (pathArray: string[], index: number) => {}
 
 const generateId = (index: number) => {
killedBy: buildTree tests simple tree
statusReason: TypeError: Cannot read properties of undefined (reading 'substring')
