[Survived] BlockStatement
src/components/list/AttributeList.tsx:27:19
     ModelAttributesSliceState
   >(attributeFakeDataState)
 
-  useEffect(() => {
-    dispatch(fetchAttributeData({ modelId: selectionState.value }))
-  }, [selectionState])
+  useEffect(() => {}, [selectionState])
   return modelAttributeState &&
     modelAttributeState.isSuccess &&

[Killed] LogicalOperator
src/components/list/AttributeList.tsx:30:10
   useEffect(() => {
     dispatch(fetchAttributeData({ modelId: selectionState.value }))
   }, [selectionState])
-  return modelAttributeState &&
-    modelAttributeState.isSuccess &&
-    !modelAttributeState.isLoading &&
-    modelAttributeState.value ? (
+  return modelAttributeState && modelAttributeState.isSuccess && !modelAttributeState.isLoading || modelAttributeState.value ? (
     <table>
       <thead>
killedBy: App render tests render APP test
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/components/list/AttributeList.tsx:30:10
   useEffect(() => {
     dispatch(fetchAttributeData({ modelId: selectionState.value }))
   }, [selectionState])
-  return modelAttributeState &&
-    modelAttributeState.isSuccess &&
-    !modelAttributeState.isLoading &&
+  return modelAttributeState && modelAttributeState.isSuccess || !modelAttributeState.isLoading &&
     modelAttributeState.value ? (
     <table>
killedBy: ModelBlock render tests render empty ModelBlock test
statusReason: TestingLibraryElementError: Unable to find an element with the text: Атрибуты модели. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[Killed] BooleanLiteral
src/components/list/AttributeList.tsx:32:5
   }, [selectionState])
   return modelAttributeState &&
     modelAttributeState.isSuccess &&
-    !modelAttributeState.isLoading &&
+    modelAttributeState.isLoading &&
     modelAttributeState.value ? (
     <table>
killedBy: ModelBlock render tests render empty ModelBlock test
statusReason: TestingLibraryElementError: Unable to find an element with the text: Атрибуты модели. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[NoCoverage] ArrowFunction
src/components/list/AttributeList.tsx:42:40
         </tr>
       </thead>
       <tbody>
-        {modelAttributeState.value.map((x) => (
-          <tr key={x.id} className={styles.td} data-testid={x.id}>
-            <td className={styles.td}>{x.name}</td>
-            <td>{x.value}</td>
-          </tr>
-        ))}
+        {modelAttributeState.value.map(() => undefined)}
       </tbody>
     </table>
