[Survived] StringLiteral
simple-viewer/src/threejs/Perspective.ts:16:33
   { id: Perspective.SOUTH, name: "Вид на юг" },
   { id: Perspective.NORTH, name: "Вид на север" },
   { id: Perspective.EAST, name: "Вид на восток" },
-  { id: Perspective.WEST, name: "Вид на запад" },
+  { id: Perspective.WEST, name: "" },
 ]
 

[Survived] BlockStatement
simple-viewer/src/threejs/Perspective.ts:19:56
   { id: Perspective.WEST, name: "Вид на запад" },
 ]
 
-export const getCoordinates = (perspective: string) => {
-  switch (perspective) {
-    case Perspective.TOP:
-      return [0, 100, 0]
-    case Perspective.BOTTOM:
-      return [0, -100, 0]
-    case Perspective.SOUTH:
-      return [100, 0, 0]
-    case Perspective.NORTH:
-      return [-100, 0, 0]
-    case Perspective.EAST:
-      return [0, 0, 100]
-    case Perspective.WEST:
-      return [0, 0, -100]
-  }
-}
+export const getCoordinates = (perspective: string) => {}
 

[Survived] ConditionalExpression
simple-viewer/src/threejs/Perspective.ts:21:5
 
 export const getCoordinates = (perspective: string) => {
   switch (perspective) {
-    case Perspective.TOP:
-      return [0, 100, 0]
+    case Perspective.TOP:
     case Perspective.BOTTOM:
       return [0, -100, 0]

[Survived] ArrayDeclaration
simple-viewer/src/threejs/Perspective.ts:22:14
 export const getCoordinates = (perspective: string) => {
   switch (perspective) {
     case Perspective.TOP:
-      return [0, 100, 0]
+      return []
     case Perspective.BOTTOM:
       return [0, -100, 0]

[NoCoverage] ConditionalExpression
simple-viewer/src/threejs/Perspective.ts:23:5
   switch (perspective) {
     case Perspective.TOP:
       return [0, 100, 0]
-    case Perspective.BOTTOM:
-      return [0, -100, 0]
+    case Perspective.BOTTOM:
     case Perspective.SOUTH:
       return [100, 0, 0]

[NoCoverage] UnaryOperator
simple-viewer/src/threejs/Perspective.ts:24:18
     case Perspective.TOP:
       return [0, 100, 0]
     case Perspective.BOTTOM:
-      return [0, -100, 0]
+      return [0, +100, 0]
     case Perspective.SOUTH:
       return [100, 0, 0]

[NoCoverage] ArrayDeclaration
simple-viewer/src/threejs/Perspective.ts:24:14
     case Perspective.TOP:
       return [0, 100, 0]
     case Perspective.BOTTOM:
-      return [0, -100, 0]
+      return []
     case Perspective.SOUTH:
       return [100, 0, 0]

[Survived] ConditionalExpression
simple-viewer/src/threejs/Perspective.ts:25:5
       return [0, 100, 0]
     case Perspective.BOTTOM:
       return [0, -100, 0]
-    case Perspective.SOUTH:
-      return [100, 0, 0]
+    case Perspective.SOUTH:
     case Perspective.NORTH:
       return [-100, 0, 0]

[NoCoverage] ConditionalExpression
simple-viewer/src/threejs/Perspective.ts:27:5
       return [0, -100, 0]
     case Perspective.SOUTH:
       return [100, 0, 0]
-    case Perspective.NORTH:
-      return [-100, 0, 0]
+    case Perspective.NORTH:
     case Perspective.EAST:
       return [0, 0, 100]

[NoCoverage] UnaryOperator
simple-viewer/src/threejs/Perspective.ts:28:15
     case Perspective.SOUTH:
       return [100, 0, 0]
     case Perspective.NORTH:
-      return [-100, 0, 0]
+      return [+100, 0, 0]
     case Perspective.EAST:
       return [0, 0, 100]

[NoCoverage] ConditionalExpression
simple-viewer/src/threejs/Perspective.ts:29:5
       return [100, 0, 0]
     case Perspective.NORTH:
       return [-100, 0, 0]
-    case Perspective.EAST:
-      return [0, 0, 100]
+    case Perspective.EAST:
     case Perspective.WEST:
       return [0, 0, -100]

[NoCoverage] ArrayDeclaration
simple-viewer/src/threejs/Perspective.ts:30:14
     case Perspective.NORTH:
       return [-100, 0, 0]
     case Perspective.EAST:
-      return [0, 0, 100]
+      return []
     case Perspective.WEST:
       return [0, 0, -100]

[NoCoverage] ConditionalExpression
simple-viewer/src/threejs/Perspective.ts:31:5
       return [-100, 0, 0]
     case Perspective.EAST:
       return [0, 0, 100]
-    case Perspective.WEST:
-      return [0, 0, -100]
+    case Perspective.WEST:
   }
 }

[NoCoverage] UnaryOperator
simple-viewer/src/threejs/Perspective.ts:32:21
     case Perspective.EAST:
       return [0, 0, 100]
     case Perspective.WEST:
-      return [0, 0, -100]
+      return [0, 0, +100]
   }
 }
