[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:4:78
 import * as THREE from "three"
 const tolerance = 1e-6
 
-export const createSection = (geometries: number[][], plane: THREE.Plane) => {
-  return geometries
-    .map((geometry) => planeIntersection(geometry, plane))
-    .filter((intersection) => intersection)
-}
+export const createSection = (geometries: number[][], plane: THREE.Plane) => {}
 
 type PointWithFace = {
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Survived] MethodExpression
simple-viewer/src/threejs/SectionHelper.ts:5:10
 const tolerance = 1e-6
 
 export const createSection = (geometries: number[][], plane: THREE.Plane) => {
-  return geometries
-    .map((geometry) => planeIntersection(geometry, plane))
-    .filter((intersection) => intersection)
+  return geometries.map(geometry => planeIntersection(geometry, plane))
 }
 

[Killed] ArrowFunction
simple-viewer/src/threejs/SectionHelper.ts:6:10
 
 export const createSection = (geometries: number[][], plane: THREE.Plane) => {
   return geometries
-    .map((geometry) => planeIntersection(geometry, plane))
+    .map(() => undefined)
     .filter((intersection) => intersection)
 }
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ArrowFunction
simple-viewer/src/threejs/SectionHelper.ts:7:13
 export const createSection = (geometries: number[][], plane: THREE.Plane) => {
   return geometries
     .map((geometry) => planeIntersection(geometry, plane))
-    .filter((intersection) => intersection)
+    .filter(() => undefined)
 }
 
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:27:47
   const pos = geometry
   let idx = 0
 
-  const setPointOfIntersection = (function () {
-    const line = new THREE.Line3()
-    const v = new THREE.Vector3()
-    return function setPointOfIntersection(
-      p1: number,
-      p2: number,
-      plane: THREE.Plane,
-      faceIdx: number
-    ) {
-      line.start = p1
-      line.end = p2
-      const p = plane.intersectLine(line, v)
-      if (p) {
-        verticesOfIntersection.push({
-          x: p.x,
-          y: p.y,
-          z: p.z,
-          faceIndex: faceIdx,
-        })
-      }
-    }
-  })()
+  const setPointOfIntersection = (function () {})()
 
   for (let i = 0; i < pos.length; i += 9) {
killedBy: Viewer render test
statusReason: TypeError: setPointOfIntersection is not a function

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:35:7
       p2: number,
       plane: THREE.Plane,
       faceIdx: number
-    ) {
-      line.start = p1
-      line.end = p2
-      const p = plane.intersectLine(line, v)
-      if (p) {
-        verticesOfIntersection.push({
-          x: p.x,
-          y: p.y,
-          z: p.z,
-          faceIndex: faceIdx,
-        })
-      }
-    }
+    ) {}
   })()
 
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:39:11
       line.start = p1
       line.end = p2
       const p = plane.intersectLine(line, v)
-      if (p) {
+      if (false) {
         verticesOfIntersection.push({
           x: p.x,
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:39:11
       line.start = p1
       line.end = p2
       const p = plane.intersectLine(line, v)
-      if (p) {
+      if (true) {
         verticesOfIntersection.push({
           x: p.x,
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of null (reading 'x')

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:50:19
     }
   })()
 
-  for (let i = 0; i < pos.length; i += 9) {
+  for (let i = 0; i >= pos.length; i += 9) {
     a.set(pos[i], pos[i + 1], pos[i + 2])
     b.set(pos[i + 3], pos[i + 4], pos[i + 5])
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:50:43
     }
   })()
 
-  for (let i = 0; i < pos.length; i += 9) {
-    a.set(pos[i], pos[i + 1], pos[i + 2])
-    b.set(pos[i + 3], pos[i + 4], pos[i + 5])
-    c.set(pos[i + 6], pos[i + 7], pos[i + 8])
-
-    setPointOfIntersection(a, b, plane, idx)
-    setPointOfIntersection(b, c, plane, idx)
-    setPointOfIntersection(c, a, plane, idx)
-    idx++
-  }
+  for (let i = 0; i < pos.length; i += 9) {}
   if (verticesOfIntersection.length > 0) {
     const contours: THREE.Vector3[][] = []
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [0, 0, 0.5, 0, 0.5, 0.5, 0, 0, 0.5]
Received: undefined

[Killed] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:51:35
   })()
 
   for (let i = 0; i < pos.length; i += 9) {
-    a.set(pos[i], pos[i + 1], pos[i + 2])
+    a.set(pos[i], pos[i + 1], pos[i - 2])
     b.set(pos[i + 3], pos[i + 4], pos[i + 5])
     c.set(pos[i + 6], pos[i + 7], pos[i + 8])
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,10 +1,10 @@
  Array [
    0.5,

[Killed] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:51:23
   })()
 
   for (let i = 0; i < pos.length; i += 9) {
-    a.set(pos[i], pos[i + 1], pos[i + 2])
+    a.set(pos[i], pos[i - 1], pos[i + 2])
     b.set(pos[i + 3], pos[i + 4], pos[i + 5])
     c.set(pos[i + 6], pos[i + 7], pos[i + 8])
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 9
+ Received  + 9

  Array [
-   0,
-   0,

[Killed] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:52:39
 
   for (let i = 0; i < pos.length; i += 9) {
     a.set(pos[i], pos[i + 1], pos[i + 2])
-    b.set(pos[i + 3], pos[i + 4], pos[i + 5])
+    b.set(pos[i + 3], pos[i + 4], pos[i - 5])
     c.set(pos[i + 6], pos[i + 7], pos[i + 8])
 
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    0,
-   0,

[Killed] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:52:27
 
   for (let i = 0; i < pos.length; i += 9) {
     a.set(pos[i], pos[i + 1], pos[i + 2])
-    b.set(pos[i + 3], pos[i + 4], pos[i + 5])
+    b.set(pos[i + 3], pos[i - 4], pos[i + 5])
     c.set(pos[i + 6], pos[i + 7], pos[i + 8])
 
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 9
+ Received  + 9

  Array [
-   0,
-   0,

[Killed] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:53:39
   for (let i = 0; i < pos.length; i += 9) {
     a.set(pos[i], pos[i + 1], pos[i + 2])
     b.set(pos[i + 3], pos[i + 4], pos[i + 5])
-    c.set(pos[i + 6], pos[i + 7], pos[i + 8])
+    c.set(pos[i + 6], pos[i + 7], pos[i - 8])
 
     setPointOfIntersection(a, b, plane, idx)
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

  Array [
-   1,
-   0,

[Killed] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:53:15
   for (let i = 0; i < pos.length; i += 9) {
     a.set(pos[i], pos[i + 1], pos[i + 2])
     b.set(pos[i + 3], pos[i + 4], pos[i + 5])
-    c.set(pos[i + 6], pos[i + 7], pos[i + 8])
+    c.set(pos[i - 6], pos[i + 7], pos[i + 8])
 
     setPointOfIntersection(a, b, plane, idx)
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    0,
    0,

[Survived] UpdateOperator
simple-viewer/src/threejs/SectionHelper.ts:58:5
     setPointOfIntersection(a, b, plane, idx)
     setPointOfIntersection(b, c, plane, idx)
     setPointOfIntersection(c, a, plane, idx)
-    idx++
+    idx--
   }
   if (verticesOfIntersection.length > 0) {

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:60:7
     setPointOfIntersection(c, a, plane, idx)
     idx++
   }
-  if (verticesOfIntersection.length > 0) {
+  if (verticesOfIntersection.length >= 0) {
     const contours: THREE.Vector3[][] = []
 
killedBy: no sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
+   Array [
      Array [],

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:60:42
     setPointOfIntersection(c, a, plane, idx)
     idx++
   }
-  if (verticesOfIntersection.length > 0) {
-    const contours: THREE.Vector3[][] = []
-
-    try {
-      getContours(verticesOfIntersection, contours, 0)
-    } catch (e) {
-      console.error("PlaneIntersection - ошибка в сопоставлении точек")
-      console.error(e)
-    }
-    for (let i = 0; i < contours.length; i++) {
-      const cntr = contours[i]
-      const cntrGeom: number[] = []
-      for (let j = 0; j < cntr.length; j++) {
-        const v = cntr[j]
-        cntrGeom.push(v.x, v.y, v.z)
-      }
-      if (cntr.length) {
-        const v = cntr[0]
-        cntrGeom.push(v.x, v.y, v.z)
-      }
-      lineCountersGroup.push(cntrGeom)
-    }
-  }
+  if (verticesOfIntersection.length > 0) {}
 
   function getContours(
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:63:9
   if (verticesOfIntersection.length > 0) {
     const contours: THREE.Vector3[][] = []
 
-    try {
-      getContours(verticesOfIntersection, contours, 0)
-    } catch (e) {
+    try {} catch (e) {
       console.error("PlaneIntersection - ошибка в сопоставлении точек")
       console.error(e)
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[NoCoverage] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:65:17
 
     try {
       getContours(verticesOfIntersection, contours, 0)
-    } catch (e) {
-      console.error("PlaneIntersection - ошибка в сопоставлении точек")
-      console.error(e)
-    }
+    } catch (e) {}
     for (let i = 0; i < contours.length; i++) {
       const cntr = contours[i]

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:69:21
       console.error("PlaneIntersection - ошибка в сопоставлении точек")
       console.error(e)
     }
-    for (let i = 0; i < contours.length; i++) {
+    for (let i = 0; false; i++) {
       const cntr = contours[i]
       const cntrGeom: number[] = []
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [0, 0, 0.5, 0, 0.5, 0.5, 0, 0, 0.5]
Received: undefined

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:69:47
       console.error("PlaneIntersection - ошибка в сопоставлении точек")
       console.error(e)
     }
-    for (let i = 0; i < contours.length; i++) {
-      const cntr = contours[i]
-      const cntrGeom: number[] = []
-      for (let j = 0; j < cntr.length; j++) {
-        const v = cntr[j]
-        cntrGeom.push(v.x, v.y, v.z)
-      }
-      if (cntr.length) {
-        const v = cntr[0]
-        cntrGeom.push(v.x, v.y, v.z)
-      }
-      lineCountersGroup.push(cntrGeom)
-    }
+    for (let i = 0; i < contours.length; i++) {}
   }
 
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:72:23
     for (let i = 0; i < contours.length; i++) {
       const cntr = contours[i]
       const cntrGeom: number[] = []
-      for (let j = 0; j < cntr.length; j++) {
+      for (let j = 0; false; j++) {
         const v = cntr[j]
         cntrGeom.push(v.x, v.y, v.z)
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 0

  Array [
    0,
    0,

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:72:23
     for (let i = 0; i < contours.length; i++) {
       const cntr = contours[i]
       const cntrGeom: number[] = []
-      for (let j = 0; j < cntr.length; j++) {
+      for (let j = 0; j <= cntr.length; j++) {
         const v = cntr[j]
         cntrGeom.push(v.x, v.y, v.z)
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'x')

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:76:11
         const v = cntr[j]
         cntrGeom.push(v.x, v.y, v.z)
       }
-      if (cntr.length) {
+      if (false) {
         const v = cntr[0]
         cntrGeom.push(v.x, v.y, v.z)
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

@@ -3,9 +3,6 @@
    0,
    0.5,

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:76:24
         const v = cntr[j]
         cntrGeom.push(v.x, v.y, v.z)
       }
-      if (cntr.length) {
-        const v = cntr[0]
-        cntrGeom.push(v.x, v.y, v.z)
-      }
+      if (cntr.length) {}
       lineCountersGroup.push(cntrGeom)
     }
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 0

@@ -3,9 +3,6 @@
    0,
    0.5,

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:88:13
     points: PointWithFace[],
     contours: THREE.Vector3[][],
     allCheck: number
-  ): number {
-    const contour: THREE.Vector3[] = []
-    let firstPoint, secondPoint
-    for (let i = 0; i < points.length; i++) {
-      if (points[i].checked) continue
-      firstPoint = points[i]
-      firstPoint.checked = true
-      secondPoint = points[getPairIndex(firstPoint, i, points)]
-      secondPoint.checked = true
-      contour.push(firstPoint)
-      contour.push(secondPoint)
-      allCheck += 2
-      break
-    }
-    if (secondPoint) {
-      allCheck += collectContour(secondPoint, points, contour)
-    }
-    contours.push(contour)
-    if (allCheck != points.length) {
-      return getContours(points, contours, allCheck)
-    }
-    return allCheck
-  }
+  ): number {}
 
   function collectContour(
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Timeout] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:91:21
   ): number {
     const contour: THREE.Vector3[] = []
     let firstPoint, secondPoint
-    for (let i = 0; i < points.length; i++) {
+    for (let i = 0; i >= points.length; i++) {
       if (points[i].checked) continue
       firstPoint = points[i]

[Survived] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:91:21
   ): number {
     const contour: THREE.Vector3[] = []
     let firstPoint, secondPoint
-    for (let i = 0; i < points.length; i++) {
+    for (let i = 0; i <= points.length; i++) {
       if (points[i].checked) continue
       firstPoint = points[i]

[Timeout] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:92:11
     const contour: THREE.Vector3[] = []
     let firstPoint, secondPoint
     for (let i = 0; i < points.length; i++) {
-      if (points[i].checked) continue
+      if (true) continue
       firstPoint = points[i]
       firstPoint.checked = true

[Survived] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:92:11
     const contour: THREE.Vector3[] = []
     let firstPoint, secondPoint
     for (let i = 0; i < points.length; i++) {
-      if (points[i].checked) continue
+      if (false) continue
       firstPoint = points[i]
       firstPoint.checked = true

[Killed] BooleanLiteral
simple-viewer/src/threejs/SectionHelper.ts:94:28
     for (let i = 0; i < points.length; i++) {
       if (points[i].checked) continue
       firstPoint = points[i]
-      firstPoint.checked = true
+      firstPoint.checked = false
       secondPoint = points[getPairIndex(firstPoint, i, points)]
       secondPoint.checked = true
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [1, 0, 0.5, 0.5, 0, 0.5, 0, 0, 0.5, 0, …]
Received: undefined

[Killed] BooleanLiteral
simple-viewer/src/threejs/SectionHelper.ts:96:29
       firstPoint = points[i]
       firstPoint.checked = true
       secondPoint = points[getPairIndex(firstPoint, i, points)]
-      secondPoint.checked = true
+      secondPoint.checked = false
       contour.push(firstPoint)
       contour.push(secondPoint)
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [0, 0, 0.5, 0, 0.5, 0.5, 0, 0, 0.5]
Received: undefined

[Timeout] AssignmentOperator
simple-viewer/src/threejs/SectionHelper.ts:99:7
       secondPoint.checked = true
       contour.push(firstPoint)
       contour.push(secondPoint)
-      allCheck += 2
+      allCheck -= 2
       break
     }

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:102:9
       allCheck += 2
       break
     }
-    if (secondPoint) {
+    if (false) {
       allCheck += collectContour(secondPoint, points, contour)
     }
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -3,30 +3,9 @@
    0,
    0.5,

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:102:22
       allCheck += 2
       break
     }
-    if (secondPoint) {
-      allCheck += collectContour(secondPoint, points, contour)
-    }
+    if (secondPoint) {}
     contours.push(contour)
     if (allCheck != points.length) {
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -3,30 +3,9 @@
    0,
    0.5,

[Survived] AssignmentOperator
simple-viewer/src/threejs/SectionHelper.ts:103:7
       break
     }
     if (secondPoint) {
-      allCheck += collectContour(secondPoint, points, contour)
+      allCheck -= collectContour(secondPoint, points, contour)
     }
     contours.push(contour)

[Survived] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:106:9
       allCheck += collectContour(secondPoint, points, contour)
     }
     contours.push(contour)
-    if (allCheck != points.length) {
+    if (false) {
       return getContours(points, contours, allCheck)
     }

[NoCoverage] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:106:36
       allCheck += collectContour(secondPoint, points, contour)
     }
     contours.push(contour)
-    if (allCheck != points.length) {
-      return getContours(points, contours, allCheck)
-    }
+    if (allCheck != points.length) {}
     return allCheck
   }

[Timeout] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:116:13
     currentPoint: PointWithFace,
     points: PointWithFace[],
     contour: THREE.Vector3[]
-  ): number {
-    const p1Index = getNearestPointIndex(currentPoint, points)
-    if (p1Index == -1) {
-      return 0
-    }
-    const p1 = points[p1Index]
-    p1.checked = true
-    const p2Index = getPairIndex(p1, p1Index, points)
-    const p2 = points[p2Index]
-    p2.checked = true
-    if (p2 != contour[0]) {
-      contour.push(p2)
-      return 2 + collectContour(p2, points, contour)
-    } else {
-      contour.push(contour[0])
-      return 2
-    }
-  }
+  ): number {}
 
   function getNearestPointIndex(point: PointWithFace, points: PointWithFace[]) {

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:118:9
     contour: THREE.Vector3[]
   ): number {
     const p1Index = getNearestPointIndex(currentPoint, points)
-    if (p1Index == -1) {
+    if (p1Index != -1) {
       return 0
     }
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:118:24
     contour: THREE.Vector3[]
   ): number {
     const p1Index = getNearestPointIndex(currentPoint, points)
-    if (p1Index == -1) {
-      return 0
-    }
+    if (p1Index == -1) {}
     const p1 = points[p1Index]
     p1.checked = true
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Survived] BooleanLiteral
simple-viewer/src/threejs/SectionHelper.ts:122:18
       return 0
     }
     const p1 = points[p1Index]
-    p1.checked = true
+    p1.checked = false
     const p2Index = getPairIndex(p1, p1Index, points)
     const p2 = points[p2Index]

[Killed] BooleanLiteral
simple-viewer/src/threejs/SectionHelper.ts:125:18
     p1.checked = true
     const p2Index = getPairIndex(p1, p1Index, points)
     const p2 = points[p2Index]
-    p2.checked = true
+    p2.checked = false
     if (p2 != contour[0]) {
       contour.push(p2)
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [1, 0, 0.5, 0.5, 0, 0.5, 0, 0, 0.5, 0, …]
Received: undefined

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:126:27
     const p2Index = getPairIndex(p1, p1Index, points)
     const p2 = points[p2Index]
     p2.checked = true
-    if (p2 != contour[0]) {
-      contour.push(p2)
-      return 2 + collectContour(p2, points, contour)
-    } else {
+    if (p2 != contour[0]) {} else {
       contour.push(contour[0])
       return 2
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -3,30 +3,9 @@
    0,
    0.5,

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:126:9
     const p2Index = getPairIndex(p1, p1Index, points)
     const p2 = points[p2Index]
     p2.checked = true
-    if (p2 != contour[0]) {
+    if (p2 == contour[0]) {
       contour.push(p2)
       return 2 + collectContour(p2, points, contour)
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 18
+ Received  +  0

@@ -3,28 +3,10 @@
    0,
    0.5,

[Survived] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:128:14
     p2.checked = true
     if (p2 != contour[0]) {
       contour.push(p2)
-      return 2 + collectContour(p2, points, contour)
+      return 2 - collectContour(p2, points, contour)
     } else {
       contour.push(contour[0])

[NoCoverage] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:129:12
     if (p2 != contour[0]) {
       contour.push(p2)
       return 2 + collectContour(p2, points, contour)
-    } else {
-      contour.push(contour[0])
-      return 2
-    }
+    } else {}
   }
 

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:135:80
     }
   }
 
-  function getNearestPointIndex(point: PointWithFace, points: PointWithFace[]) {
-    for (let i = 0; i < points.length; i++) {
-      const p = points[i]
-      if (!p.checked && equalsVec(p, point, tolerance)) {
-        return i
-      }
-    }
-    return -1
-  }
+  function getNearestPointIndex(point: PointWithFace, points: PointWithFace[]) {}
 
   function getPairIndex(
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:136:21
   }
 
   function getNearestPointIndex(point: PointWithFace, points: PointWithFace[]) {
-    for (let i = 0; i < points.length; i++) {
+    for (let i = 0; i >= points.length; i++) {
       const p = points[i]
       if (!p.checked && equalsVec(p, point, tolerance)) {
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -3,30 +3,9 @@
    0,
    0.5,

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:136:21
   }
 
   function getNearestPointIndex(point: PointWithFace, points: PointWithFace[]) {
-    for (let i = 0; i < points.length; i++) {
+    for (let i = 0; i <= points.length; i++) {
       const p = points[i]
       if (!p.checked && equalsVec(p, point, tolerance)) {
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] LogicalOperator
simple-viewer/src/threejs/SectionHelper.ts:138:11
   function getNearestPointIndex(point: PointWithFace, points: PointWithFace[]) {
     for (let i = 0; i < points.length; i++) {
       const p = points[i]
-      if (!p.checked && equalsVec(p, point, tolerance)) {
+      if (!p.checked || equalsVec(p, point, tolerance)) {
         return i
       }
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] BooleanLiteral
simple-viewer/src/threejs/SectionHelper.ts:138:11
   function getNearestPointIndex(point: PointWithFace, points: PointWithFace[]) {
     for (let i = 0; i < points.length; i++) {
       const p = points[i]
-      if (!p.checked && equalsVec(p, point, tolerance)) {
+      if (p.checked && equalsVec(p, point, tolerance)) {
         return i
       }
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] UnaryOperator
simple-viewer/src/threejs/SectionHelper.ts:142:12
         return i
       }
     }
-    return -1
+    return +1
   }
 
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:149:5
     point: PointWithFace,
     pointIndex: number,
     points: PointWithFace[]
-  ) {
-    for (let i = 0; i < points.length; i++) {
-      const p = points[i]
-      if (i != pointIndex && !p.checked && p.faceIndex == point.faceIndex) {
-        return i
-      }
-    }
-    return -1
-  }
+  ) {}
 
   function equalsVec(v1: THREE.Vector3, v2: THREE.Vector3, tolerance: number) {
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [0, 0, 0.5, 0, 0.5, 0.5, 0, 0, 0.5]
Received: undefined

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:150:45
     pointIndex: number,
     points: PointWithFace[]
   ) {
-    for (let i = 0; i < points.length; i++) {
-      const p = points[i]
-      if (i != pointIndex && !p.checked && p.faceIndex == point.faceIndex) {
-        return i
-      }
-    }
+    for (let i = 0; i < points.length; i++) {}
     return -1
   }
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:150:21
     pointIndex: number,
     points: PointWithFace[]
   ) {
-    for (let i = 0; i < points.length; i++) {
+    for (let i = 0; false; i++) {
       const p = points[i]
       if (i != pointIndex && !p.checked && p.faceIndex == point.faceIndex) {
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] LogicalOperator
simple-viewer/src/threejs/SectionHelper.ts:152:11
   ) {
     for (let i = 0; i < points.length; i++) {
       const p = points[i]
-      if (i != pointIndex && !p.checked && p.faceIndex == point.faceIndex) {
+      if (i != pointIndex && !p.checked || p.faceIndex == point.faceIndex) {
         return i
       }
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
    0,

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:152:11
   ) {
     for (let i = 0; i < points.length; i++) {
       const p = points[i]
-      if (i != pointIndex && !p.checked && p.faceIndex == point.faceIndex) {
+      if (true) {
         return i
       }
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
    0,

[Killed] BlockStatement
simple-viewer/src/threejs/SectionHelper.ts:159:79
     return -1
   }
 
-  function equalsVec(v1: THREE.Vector3, v2: THREE.Vector3, tolerance: number) {
-    return (
-      Math.abs(v1.x - v2.x) < tolerance &&
-      Math.abs(v1.y - v2.y) < tolerance &&
-      Math.abs(v1.z - v2.z) < tolerance
-    )
-  }
+  function equalsVec(v1: THREE.Vector3, v2: THREE.Vector3, tolerance: number) {}
   return lineCountersGroup
 }
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -3,30 +3,9 @@
    0,
    0.5,

[Killed] ConditionalExpression
simple-viewer/src/threejs/SectionHelper.ts:161:7
 
   function equalsVec(v1: THREE.Vector3, v2: THREE.Vector3, tolerance: number) {
     return (
-      Math.abs(v1.x - v2.x) < tolerance &&
-      Math.abs(v1.y - v2.y) < tolerance &&
-      Math.abs(v1.z - v2.z) < tolerance
+      false
     )
   }
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -3,30 +3,9 @@
    0,
    0.5,
