[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:161:7
 
   function equalsVec(v1: THREE.Vector3, v2: THREE.Vector3, tolerance: number) {
     return (
-      Math.abs(v1.x - v2.x) < tolerance &&
+      Math.abs(v1.x - v2.x) >= tolerance &&
       Math.abs(v1.y - v2.y) < tolerance &&
       Math.abs(v1.z - v2.z) < tolerance
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

@@ -3,26 +3,20 @@
    0,
    0.5,

[Killed] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:162:16
   function equalsVec(v1: THREE.Vector3, v2: THREE.Vector3, tolerance: number) {
     return (
       Math.abs(v1.x - v2.x) < tolerance &&
-      Math.abs(v1.y - v2.y) < tolerance &&
+      Math.abs(v1.y + v2.y) < tolerance &&
       Math.abs(v1.z - v2.z) < tolerance
     )
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 15
+ Received  +  0

@@ -9,24 +9,9 @@
    0,
    0.5,

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:162:7
   function equalsVec(v1: THREE.Vector3, v2: THREE.Vector3, tolerance: number) {
     return (
       Math.abs(v1.x - v2.x) < tolerance &&
-      Math.abs(v1.y - v2.y) < tolerance &&
+      Math.abs(v1.y - v2.y) >= tolerance &&
       Math.abs(v1.z - v2.z) < tolerance
     )
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

@@ -4,26 +4,20 @@
    0.5,
    0.5,

[Killed] ArithmeticOperator
simple-viewer/src/threejs/SectionHelper.ts:163:16
     return (
       Math.abs(v1.x - v2.x) < tolerance &&
       Math.abs(v1.y - v2.y) < tolerance &&
-      Math.abs(v1.z - v2.z) < tolerance
+      Math.abs(v1.z + v2.z) < tolerance
     )
   }
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -3,30 +3,9 @@
    0,
    0.5,

[Killed] EqualityOperator
simple-viewer/src/threejs/SectionHelper.ts:163:7
     return (
       Math.abs(v1.x - v2.x) < tolerance &&
       Math.abs(v1.y - v2.y) < tolerance &&
-      Math.abs(v1.z - v2.z) < tolerance
+      Math.abs(v1.z - v2.z) >= tolerance
     )
   }
killedBy: sections calc test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 21
+ Received  +  0

@@ -3,30 +3,9 @@
    0,
    0.5,
