[Killed] BlockStatement
src/threejs/viewergroup/ViewerGroup.tsx:23:6
   checks: number[],
   materialStyle: string,
   titleVisible: boolean
-) => {
-  return models
-    .filter((x, index) => checks[index])
-    .filter((x) => x.triangulation)
-    .map((x) => (
-      // Stryker disable next-line StringLiteral
-      <Fragment key={"view" + x.id}>
-        <ModelMesh
-          color={x.color ? x.color : DEFAULT_COLOR}
-          vertices={x.triangulation}
-          style={materialStyle}
-        />
-        {titleVisible ? (
-          <Html center position={x.center}>
-            <div style={{ color: x.color ? invert(x.color) : "#FFFFFF" }}>
-              {x.name}
-            </div>
-          </Html>
-        ) : (
-          <></>
-        )}
-      </Fragment>
-    ))
-}
+) => {}
 
 export const ViewerGroup = ({
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] MethodExpression
src/threejs/viewergroup/ViewerGroup.tsx:24:10
   materialStyle: string,
   titleVisible: boolean
 ) => {
-  return models
-    .filter((x, index) => checks[index])
+  return models
     .filter((x) => x.triangulation)
     .map((x) => (
killedBy: Title on, one geom off render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] MethodExpression
src/threejs/viewergroup/ViewerGroup.tsx:24:10
   materialStyle: string,
   titleVisible: boolean
 ) => {
-  return models
-    .filter((x, index) => checks[index])
-    .filter((x) => x.triangulation)
+  return models.filter((x, index) => checks[index])
     .map((x) => (
       // Stryker disable next-line StringLiteral
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 4

[Killed] ArrowFunction
src/threejs/viewergroup/ViewerGroup.tsx:25:13
   titleVisible: boolean
 ) => {
   return models
-    .filter((x, index) => checks[index])
+    .filter(() => undefined)
     .filter((x) => x.triangulation)
     .map((x) => (
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArrowFunction
src/threejs/viewergroup/ViewerGroup.tsx:26:13
 ) => {
   return models
     .filter((x, index) => checks[index])
-    .filter((x) => x.triangulation)
+    .filter(() => undefined)
     .map((x) => (
       // Stryker disable next-line StringLiteral
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] ArrowFunction
src/threejs/viewergroup/ViewerGroup.tsx:27:10
   return models
     .filter((x, index) => checks[index])
     .filter((x) => x.triangulation)
-    .map((x) => (
-      // Stryker disable next-line StringLiteral
-      <Fragment key={"view" + x.id}>
-        <ModelMesh
-          color={x.color ? x.color : DEFAULT_COLOR}
-          vertices={x.triangulation}
-          style={materialStyle}
-        />
-        {titleVisible ? (
-          <Html center position={x.center}>
-            <div style={{ color: x.color ? invert(x.color) : "#FFFFFF" }}>
-              {x.name}
-            </div>
-          </Html>
-        ) : (
-          <></>
-        )}
-      </Fragment>
-    ))
+    .map(() => undefined)
 }
 
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Survived] ObjectLiteral
src/threejs/viewergroup/ViewerGroup.tsx:37:25
         />
         {titleVisible ? (
           <Html center position={x.center}>
-            <div style={{ color: x.color ? invert(x.color) : "#FFFFFF" }}>
+            <div style={{}}>
               {x.name}
             </div>

[Killed] BlockStatement
src/threejs/viewergroup/ViewerGroup.tsx:52:25
   materialStyle,
   titleVisible,
   sectionPlane,
-}: ViewerGroupProps) => {
-  const checksState = useSelector<AppStateType, CheckboxSliceState>(
-    checkboxState
-  )
-  const viewObjects = getMeshes(
-    checksState.tree,
-    checksState.value,
-    materialStyle,
-    titleVisible ? true : false
-  )
-  if (sectionPlane) {
-    viewObjects.push(
-      <Sections key={"sections"} models={checksState.tree} plane={sectionPlane}></Sections>
-    )
-  }
-  return <group position={[0, 0, 0]}>{viewObjects}</group>
-}
+}: ViewerGroupProps) => {}
 
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
src/threejs/viewergroup/ViewerGroup.tsx:60:27
     checksState.tree,
     checksState.value,
     materialStyle,
-    titleVisible ? true : false
+    titleVisible ? true : true
   )
   if (sectionPlane) {
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 5

[Killed] BooleanLiteral
src/threejs/viewergroup/ViewerGroup.tsx:60:20
     checksState.tree,
     checksState.value,
     materialStyle,
-    titleVisible ? true : false
+    titleVisible ? false : false
   )
   if (sectionPlane) {
killedBy: Title on, one geom off render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
src/threejs/viewergroup/ViewerGroup.tsx:62:7
     materialStyle,
     titleVisible ? true : false
   )
-  if (sectionPlane) {
+  if (false) {
     viewObjects.push(
       <Sections key={"sections"} models={checksState.tree} plane={sectionPlane}></Sections>
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

[Killed] BlockStatement
src/threejs/viewergroup/ViewerGroup.tsx:62:21
     materialStyle,
     titleVisible ? true : false
   )
-  if (sectionPlane) {
-    viewObjects.push(
-      <Sections key={"sections"} models={checksState.tree} plane={sectionPlane}></Sections>
-    )
-  }
+  if (sectionPlane) {}
   return <group position={[0, 0, 0]}>{viewObjects}</group>
 }
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2
