[Killed] BlockStatement
src/components/app/App.tsx:10:38
 
 type AppProps = {}
 
-export const App = ({}: AppProps) => {
-  const dispatch = useDispatch()
-  useEffect(
-    () => {
-      dispatch(fetchData())
-    },
-    // Stryker disable next-line ArrayDeclaration
-    []
-  )
-  return (
-    <div className={styles.app}>
-      <ModelBlock />
-      <ViewerBlock />
-    </div>
-  )
-}
+export const App = ({}: AppProps) => {}
 
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelBlock"]

Ignored nodes: comments, <script />, <style />
<body>
  <div />
</body>

[Killed] BlockStatement
src/components/app/App.tsx:13:11
 export const App = ({}: AppProps) => {
   const dispatch = useDispatch()
   useEffect(
-    () => {
-      dispatch(fetchData())
-    },
+    () => {},
     // Stryker disable next-line ArrayDeclaration
     []
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >
