[Killed] ArrowFunction
src/components/block/Block.tsx:13:38
   style?: {}
 }
 
-export const Block: FC<BlockProps> = ({ title, widgets, children, style }) => (
-  <div
-    // Stryker disable next-line StringLiteral
-    key={"mn" + title}
-    data-testid={title}
-    className={styles.block}
-    style={style}
-  >
-    <div
-      // Stryker disable next-line StringLiteral
-      key={"bt" + title}
-      className={styles.blockTitle}
-    >
-      <ButtonPanel title={title}>{widgets}</ButtonPanel>
-    </div>
-
-    <div
-      // Stryker disable next-line StringLiteral
-      key={"bl" + title}
-      className={styles.blockContent}
-    >
-      {children}
-    </div>
-  </div>
-)
+export const Block: FC<BlockProps> = () => undefined
 
killedBy: ModelBlock render tests render empty ModelBlock test
statusReason: TestingLibraryElementError: Unable to find an element with the text: Атрибуты модели. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"
