[Killed] BlockStatement
src/components/checkbox/Checkbox.tsx:10:19
 
 export const Checkbox = ({ onClick, initialState }: CheckboxProps) => {
   const checkboxRef = useRef<HTMLInputElement>(null)
-  useEffect(() => {
-    //Stryker disable next-line ConditionalExpression
-    if (checkboxRef.current != null) {
-      if (initialState === 1) {
-        checkboxRef.current.checked = true
-        checkboxRef.current.indeterminate = false
-      } else if (initialState === 0) {
-        //Stryker disable next-line BlockStatement
-        checkboxRef.current.checked = false
-        checkboxRef.current.indeterminate = false
-      } else {
-        checkboxRef.current.checked = false
-        checkboxRef.current.indeterminate = true
-      }
-    }
-  }, [initialState])
+  useEffect(() => {}, [initialState])
 
   return (
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] EqualityOperator
src/components/checkbox/Checkbox.tsx:12:9
   const checkboxRef = useRef<HTMLInputElement>(null)
   useEffect(() => {
     //Stryker disable next-line ConditionalExpression
-    if (checkboxRef.current != null) {
+    if (checkboxRef.current == null) {
       if (initialState === 1) {
         checkboxRef.current.checked = true
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] BlockStatement
src/components/checkbox/Checkbox.tsx:12:38
   const checkboxRef = useRef<HTMLInputElement>(null)
   useEffect(() => {
     //Stryker disable next-line ConditionalExpression
-    if (checkboxRef.current != null) {
-      if (initialState === 1) {
-        checkboxRef.current.checked = true
-        checkboxRef.current.indeterminate = false
-      } else if (initialState === 0) {
-        //Stryker disable next-line BlockStatement
-        checkboxRef.current.checked = false
-        checkboxRef.current.indeterminate = false
-      } else {
-        checkboxRef.current.checked = false
-        checkboxRef.current.indeterminate = true
-      }
-    }
+    if (checkboxRef.current != null) {}
   }, [initialState])
 
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] ConditionalExpression
src/components/checkbox/Checkbox.tsx:13:11
   useEffect(() => {
     //Stryker disable next-line ConditionalExpression
     if (checkboxRef.current != null) {
-      if (initialState === 1) {
+      if (true) {
         checkboxRef.current.checked = true
         checkboxRef.current.indeterminate = false
killedBy: Checkbox render tests render Checkbox unchecked initialstate test
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] EqualityOperator
src/components/checkbox/Checkbox.tsx:13:11
   useEffect(() => {
     //Stryker disable next-line ConditionalExpression
     if (checkboxRef.current != null) {
-      if (initialState === 1) {
+      if (initialState !== 1) {
         checkboxRef.current.checked = true
         checkboxRef.current.indeterminate = false
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] BooleanLiteral
src/components/checkbox/Checkbox.tsx:14:39
     //Stryker disable next-line ConditionalExpression
     if (checkboxRef.current != null) {
       if (initialState === 1) {
-        checkboxRef.current.checked = true
+        checkboxRef.current.checked = false
         checkboxRef.current.indeterminate = false
       } else if (initialState === 0) {
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] BooleanLiteral
src/components/checkbox/Checkbox.tsx:15:45
     if (checkboxRef.current != null) {
       if (initialState === 1) {
         checkboxRef.current.checked = true
-        checkboxRef.current.indeterminate = false
+        checkboxRef.current.indeterminate = true
       } else if (initialState === 0) {
         //Stryker disable next-line BlockStatement
killedBy: Checkbox render tests render Checkbox test
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] ConditionalExpression
src/components/checkbox/Checkbox.tsx:16:18
       if (initialState === 1) {
         checkboxRef.current.checked = true
         checkboxRef.current.indeterminate = false
-      } else if (initialState === 0) {
+      } else if (true) {
         //Stryker disable next-line BlockStatement
         checkboxRef.current.checked = false
killedBy: Checkbox render tests halfcheck Checkbox test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] EqualityOperator
src/components/checkbox/Checkbox.tsx:16:18
       if (initialState === 1) {
         checkboxRef.current.checked = true
         checkboxRef.current.indeterminate = false
-      } else if (initialState === 0) {
+      } else if (initialState !== 0) {
         //Stryker disable next-line BlockStatement
         checkboxRef.current.checked = false
killedBy: Checkbox render tests render Checkbox unchecked initialstate test
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
src/components/checkbox/Checkbox.tsx:18:39
         checkboxRef.current.indeterminate = false
       } else if (initialState === 0) {
         //Stryker disable next-line BlockStatement
-        checkboxRef.current.checked = false
+        checkboxRef.current.checked = true
         checkboxRef.current.indeterminate = false
       } else {
killedBy: Checkbox render tests render Checkbox unchecked initialstate test
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BooleanLiteral
src/components/checkbox/Checkbox.tsx:19:45
       } else if (initialState === 0) {
         //Stryker disable next-line BlockStatement
         checkboxRef.current.checked = false
-        checkboxRef.current.indeterminate = false
+        checkboxRef.current.indeterminate = true
       } else {
         checkboxRef.current.checked = false
killedBy: Checkbox render tests render Checkbox unchecked initialstate test
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/components/checkbox/Checkbox.tsx:20:14
         //Stryker disable next-line BlockStatement
         checkboxRef.current.checked = false
         checkboxRef.current.indeterminate = false
-      } else {
-        checkboxRef.current.checked = false
-        checkboxRef.current.indeterminate = true
-      }
+      } else {}
     }
   }, [initialState])
killedBy: Checkbox render tests halfcheck Checkbox test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/components/checkbox/Checkbox.tsx:21:39
         checkboxRef.current.checked = false
         checkboxRef.current.indeterminate = false
       } else {
-        checkboxRef.current.checked = false
+        checkboxRef.current.checked = true
         checkboxRef.current.indeterminate = true
       }
killedBy: Checkbox render tests halfcheck Checkbox test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
src/components/checkbox/Checkbox.tsx:22:45
         checkboxRef.current.indeterminate = false
       } else {
         checkboxRef.current.checked = false
-        checkboxRef.current.indeterminate = true
+        checkboxRef.current.indeterminate = false
       }
     }
killedBy: Checkbox render tests halfcheck Checkbox test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrowFunction
src/components/checkbox/Checkbox.tsx:32:16
       type="checkbox"
       data-testid="checkbox"
       ref={checkboxRef}
-      onClick={() =>
-        onClick(checkboxRef.current && checkboxRef.current.checked ? 1 : 0)
+      onClick={() => undefined
       }
     />
killedBy: Checkbox render tests render Checkbox test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: -5

[Killed] ConditionalExpression
src/components/checkbox/Checkbox.tsx:33:17
       data-testid="checkbox"
       ref={checkboxRef}
       onClick={() =>
-        onClick(checkboxRef.current && checkboxRef.current.checked ? 1 : 0)
+        onClick(true ? 1 : 0)
       }
     />
killedBy: TreeParent render tests checkbox test
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/components/checkbox/Checkbox.tsx:33:17
       data-testid="checkbox"
       ref={checkboxRef}
       onClick={() =>
-        onClick(checkboxRef.current && checkboxRef.current.checked ? 1 : 0)
+        onClick(false ? 1 : 0)
       }
     />
killedBy: Checkbox render tests render Checkbox test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0
