[Killed] BlockStatement
src/components/tree/ModelTree.tsx:22:6
   state: number,
   index: number,
   dispatch: Dispatch<AnyAction>
-) => {
-  dispatch(update({ cellIndex: index, cellState: state }))
-}
+) => {}
 
 const getModelClickHandler = (
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:29:6
 const getModelClickHandler = (
   modelId: number,
   dispatch: Dispatch<AnyAction>
-) => {
-  dispatch(select({ modelId }))
-}
+) => {}
 
 const getLeafComp = (
killedBy: click tests detail click test
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:38:6
   isChecked: number,
   index: number,
   dispatch: Dispatch<AnyAction>
-) => {
-  return (
-    <TreeLeaf
-      id={model.id.toString()}
-      name={model.name}
-      onCheckboxClick={(state) => {
-        getCheckClickHandler(state, index, dispatch)
-      }}
-      onRowClick={() => {
-        getModelClickHandler(model.id, dispatch)
-      }}
-      isChecked={isChecked}
-      // Stryker disable next-line StringLiteral
-      key={"tl" + model.id}
-    />
-  )
-}
+) => {}
 
 const getParentComp = (
killedBy: ModelTree render tests render ModelTree test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeLeaf"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <ul
      class="ul"
      data-testid="modelTree"

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:43:35
     <TreeLeaf
       id={model.id.toString()}
       name={model.name}
-      onCheckboxClick={(state) => {
-        getCheckClickHandler(state, index, dispatch)
-      }}
+      onCheckboxClick={(state) => {}}
       onRowClick={() => {
         getModelClickHandler(model.id, dispatch)
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:46:25
       onCheckboxClick={(state) => {
         getCheckClickHandler(state, index, dispatch)
       }}
-      onRowClick={() => {
-        getModelClickHandler(model.id, dispatch)
-      }}
+      onRowClick={() => {}}
       isChecked={isChecked}
       // Stryker disable next-line StringLiteral
killedBy: click tests detail click test
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:63:6
   isOpen: boolean,
   dispatch: Dispatch<AnyAction>,
   children: JSX.Element[]
-) => {
-  return (
-    <TreeParent
-      // Stryker disable next-line StringLiteral
-      key={"tp" + model.id}
-      id={model.id.toString()}
-      name={model.name}
-      isChecked={isChecked}
-      isOpen={isOpen}
-      onCheckboxClick={(state) => {
-        getCheckClickHandler(state, index, dispatch)
-      }}
-    >
-      {children}
-    </TreeParent>
-  )
-}
+) => {}
 
 const buildTreeRecursive = (
killedBy: Buttons click tests collapse/expand all click
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeParentCont1000"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:72:35
       name={model.name}
       isChecked={isChecked}
       isOpen={isOpen}
-      onCheckboxClick={(state) => {
-        getCheckClickHandler(state, index, dispatch)
-      }}
+      onCheckboxClick={(state) => {}}
     >
       {children}
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [2, 0, 2, 0, 1, 1, 1, 1, 1, 1, …]

[Killed] ConditionalExpression
src/components/tree/ModelTree.tsx:90:7
 ): { comp: JSX.Element; currentIndex: number } => {
   const currentModel = models[index]
   const currentPath = getCurrentPath(models[index])
-  if (isLeaf(models, index, currentPath)) {
+  if (false) {
     return {
       comp: getLeafComp(
killedBy: ModelTree render tests render ModelTree test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeLeaf"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <ul
      class="ul"
      data-testid="modelTree"

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:90:43
 ): { comp: JSX.Element; currentIndex: number } => {
   const currentModel = models[index]
   const currentPath = getCurrentPath(models[index])
-  if (isLeaf(models, index, currentPath)) {
-    return {
-      comp: getLeafComp(
-        currentModel,
-        checksState.value[index],
-        index,
-        dispatch
-      ),
-      currentIndex: index + 1,
-    }
-  } else {
+  if (isLeaf(models, index, currentPath)) {} else {
     let nextNodeIndex = index + 1
     // Stryker disable next-line ArrayDeclaration
killedBy: ModelBlock render tests render ModelBlock with loaded tree test
statusReason: TypeError: Cannot destructure property 'comp' of 'buildTreeRecursive(...)' as it is undefined.

[Timeout] ArithmeticOperator
src/components/tree/ModelTree.tsx:98:21
         index,
         dispatch
       ),
-      currentIndex: index + 1,
+      currentIndex: index - 1,
     }
   } else {

[Killed] ArithmeticOperator
src/components/tree/ModelTree.tsx:101:25
       currentIndex: index + 1,
     }
   } else {
-    let nextNodeIndex = index + 1
+    let nextNodeIndex = index - 1
     // Stryker disable next-line ArrayDeclaration
     const children = []
killedBy: ModelBlock render tests render ModelBlock with loaded tree test
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] EqualityOperator
src/components/tree/ModelTree.tsx:105:7
     // Stryker disable next-line ArrayDeclaration
     const children = []
     while (
-      nextNodeIndex < models.length &&
+      nextNodeIndex >= models.length &&
       models[nextNodeIndex].path === currentPath
     ) {
killedBy: ModelTree render tests render short tree test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
src/components/tree/ModelTree.tsx:105:7
     // Stryker disable next-line ArrayDeclaration
     const children = []
     while (
-      nextNodeIndex < models.length &&
-      models[nextNodeIndex].path === currentPath
+      nextNodeIndex < models.length || models[nextNodeIndex].path === currentPath
     ) {
       const { comp, currentIndex } = buildTreeRecursive(
killedBy: ModelBlock render tests render ModelBlock with loaded tree test
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] ConditionalExpression
src/components/tree/ModelTree.tsx:106:7
     const children = []
     while (
       nextNodeIndex < models.length &&
-      models[nextNodeIndex].path === currentPath
+      true
     ) {
       const { comp, currentIndex } = buildTreeRecursive(
killedBy: ModelTree render tests render short tree test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] EqualityOperator
src/components/tree/ModelTree.tsx:106:7
     const children = []
     while (
       nextNodeIndex < models.length &&
-      models[nextNodeIndex].path === currentPath
+      models[nextNodeIndex].path !== currentPath
     ) {
       const { comp, currentIndex } = buildTreeRecursive(
killedBy: ModelTree render tests render short tree test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Timeout] BlockStatement
src/components/tree/ModelTree.tsx:107:7
     while (
       nextNodeIndex < models.length &&
       models[nextNodeIndex].path === currentPath
-    ) {
-      const { comp, currentIndex } = buildTreeRecursive(
-        models,
-        nextNodeIndex,
-        checksState,
-        nodeState,
-        dispatch
-      )
-      nextNodeIndex = currentIndex
-      children.push(comp)
-    }
+    ) {}
     return {
       comp: getParentComp(

[Killed] ObjectLiteral
src/components/tree/ModelTree.tsx:118:12
       nextNodeIndex = currentIndex
       children.push(comp)
     }
-    return {
-      comp: getParentComp(
-        currentModel,
-        checksState.value[index],
-        index,
-        nodeState.isOpen,
-        dispatch,
-        children
-      ),
-      currentIndex: nextNodeIndex,
-    }
+    return {}
   }
 }
killedBy: Buttons click tests collapse/expand all click
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeParentCont1000"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:137:6
   checksState: CheckboxSliceState,
   nodeState: TreeSliceState,
   dispatch: Dispatch<AnyAction>
-) => {
-  let index = 0
-  // Stryker disable next-line ArrayDeclaration
-  const rootNodes: JSX.Element[] = []
-  while (models && index < models.length) {
-    const { comp, currentIndex } = buildTreeRecursive(
-      models,
-      index,
-      checksState,
-      nodeState,
-      dispatch
-    )
-    index = currentIndex
-    rootNodes.push(comp)
-  }
-  return rootNodes
-}
+) => {}
 
 export const ModelTree: React.FC<ModelTreeProps> = ({ models }) => {
killedBy: ModelTree render tests render ModelTree test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="checkbox"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <ul
      class="ul"
      data-testid="modelTree"

[Killed] EqualityOperator
src/components/tree/ModelTree.tsx:141:20
   let index = 0
   // Stryker disable next-line ArrayDeclaration
   const rootNodes: JSX.Element[] = []
-  while (models && index < models.length) {
+  while (models && index <= models.length) {
     const { comp, currentIndex } = buildTreeRecursive(
       models,
killedBy: App render tests render APP test
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] EqualityOperator
src/components/tree/ModelTree.tsx:141:20
   let index = 0
   // Stryker disable next-line ArrayDeclaration
   const rootNodes: JSX.Element[] = []
-  while (models && index < models.length) {
+  while (models && index >= models.length) {
     const { comp, currentIndex } = buildTreeRecursive(
       models,
killedBy: ModelTree render tests render ModelTree test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="checkbox"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <ul
      class="ul"
      data-testid="modelTree"

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:155:68
   return rootNodes
 }
 
-export const ModelTree: React.FC<ModelTreeProps> = ({ models }) => {
-  const dispatch = useDispatch()
-  const checksState = useSelector<AppStateType, CheckboxSliceState>(
-    checkboxState
-  )
-  const nodesState = useSelector<AppStateType, TreeSliceState>(treeNodesState)
-
-  useEffect(() => {
-    if (!checksState.tree.length) {
-      const checks: number[] = new Array(models.length)
-      checks.fill(1, 0, models.length)
-      dispatch(init({ tree: models, checks }))
-    }
-  }, [checksState])
-
-  return (
-    <ul data-testid="modelTree" className={styles.ul}>
-      {checksState.tree.length ? (
-        buildTree(models, checksState, nodesState, dispatch)
-      ) : (
-        <div>Загрузка данных...</div>
-      )}
-    </ul>
-  )
-}
+export const ModelTree: React.FC<ModelTreeProps> = ({ models }) => {}
 
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >

[Killed] BlockStatement
src/components/tree/ModelTree.tsx:162:19
   )
   const nodesState = useSelector<AppStateType, TreeSliceState>(treeNodesState)
 
-  useEffect(() => {
-    if (!checksState.tree.length) {
-      const checks: number[] = new Array(models.length)
-      checks.fill(1, 0, models.length)
-      dispatch(init({ tree: models, checks }))
-    }
-  }, [checksState])
+  useEffect(() => {}, [checksState])
 
   return (
killedBy: Buttons click tests collapse/expand all click
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeParentCont1000"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[Killed] ConditionalExpression
src/components/tree/ModelTree.tsx:163:9
   const nodesState = useSelector<AppStateType, TreeSliceState>(treeNodesState)
 
   useEffect(() => {
-    if (!checksState.tree.length) {
+    if (true) {
       const checks: number[] = new Array(models.length)
       checks.fill(1, 0, models.length)
killedBy: ModelTree render tests render ModelTree test
statusReason: Error: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.

[Killed] BooleanLiteral
src/components/tree/ModelTree.tsx:163:9
   const nodesState = useSelector<AppStateType, TreeSliceState>(treeNodesState)
 
   useEffect(() => {
-    if (!checksState.tree.length) {
+    if (checksState.tree.length) {
       const checks: number[] = new Array(models.length)
       checks.fill(1, 0, models.length)
killedBy: Buttons click tests collapse/expand all click
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeParentCont1000"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[Survived] ArrayDeclaration
src/components/tree/ModelTree.tsx:164:32
 
   useEffect(() => {
     if (!checksState.tree.length) {
-      const checks: number[] = new Array(models.length)
+      const checks: number[] = new Array()
       checks.fill(1, 0, models.length)
       dispatch(init({ tree: models, checks }))

[Survived] ArrayDeclaration
src/components/tree/ModelTree.tsx:168:6
       checks.fill(1, 0, models.length)
       dispatch(init({ tree: models, checks }))
     }
-  }, [checksState])
+  }, [])
 
   return (
