[Killed] BlockStatement
src/components/treeparent/TreeParent.tsx:24:19
 }) => {
   const [nodeOpen, setNodeOpen] = useState(isOpen)
 
-  useEffect(() => {
-    if (nodeOpen !== isOpen) {
-      setNodeOpen(isOpen)
-    }
-  }, [isOpen])
+  useEffect(() => {}, [isOpen])
   // Stryker disable next-line ArrayDeclaration
   const currentPathArray = []
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("nested")

Expected the element to have class:
  nested
Received:
  active

[Killed] BlockStatement
src/components/treeparent/TreeParent.tsx:25:30
   const [nodeOpen, setNodeOpen] = useState(isOpen)
 
   useEffect(() => {
-    if (nodeOpen !== isOpen) {
-      setNodeOpen(isOpen)
-    }
+    if (nodeOpen !== isOpen) {}
   }, [isOpen])
   // Stryker disable next-line ArrayDeclaration
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("nested")

Expected the element to have class:
  nested
Received:
  active

[Killed] ConditionalExpression
src/components/treeparent/TreeParent.tsx:25:9
   const [nodeOpen, setNodeOpen] = useState(isOpen)
 
   useEffect(() => {
-    if (nodeOpen !== isOpen) {
+    if (false) {
       setNodeOpen(isOpen)
     }
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("nested")

Expected the element to have class:
  nested
Received:
  active

[Killed] ArrayDeclaration
src/components/treeparent/TreeParent.tsx:28:6
     if (nodeOpen !== isOpen) {
       setNodeOpen(isOpen)
     }
-  }, [isOpen])
+  }, [])
   // Stryker disable next-line ArrayDeclaration
   const currentPathArray = []
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("nested")

Expected the element to have class:
  nested
Received:
  active

[Killed] StringLiteral
src/components/treeparent/TreeParent.tsx:37:22
       key={"dv" + id}
     >
       <span
-        data-testid={"row" + id}
+        data-testid={"" + id}
         id={id}
         className={styles.caret}
killedBy: ModelTree render tests render short tree test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="row1"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <ul
      class="ul"
      data-testid="modelTree"

[Killed] BlockStatement
src/components/treeparent/TreeParent.tsx:40:24
         data-testid={"row" + id}
         id={id}
         className={styles.caret}
-        onClick={() => {
-          setNodeOpen((prev) => !prev)
-        }}
+        onClick={() => {}}
       />
       <Checkbox
killedBy: TreeParent render tests open/close test
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  nested

[Killed] ArrowFunction
src/components/treeparent/TreeParent.tsx:41:23
         id={id}
         className={styles.caret}
         onClick={() => {
-          setNodeOpen((prev) => !prev)
+          setNodeOpen(() => undefined)
         }}
       />
killedBy: TreeParent render tests open/close test
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  nested

[Killed] BooleanLiteral
src/components/treeparent/TreeParent.tsx:41:33
         id={id}
         className={styles.caret}
         onClick={() => {
-          setNodeOpen((prev) => !prev)
+          setNodeOpen((prev) => prev)
         }}
       />
killedBy: TreeParent render tests open/close test
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  nested

[Killed] BlockStatement
src/components/treeparent/TreeParent.tsx:47:25
       <Checkbox
         // Stryker disable next-line StringLiteral
         data-testid={"cb" + id}
-        onClick={(e) => {
-          onCheckboxClick(e)
-        }}
+        onClick={(e) => {}}
         initialState={isChecked}
       />
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [2, 0, 2, 0, 1, 1, 1, 1, 1, 1, …]

[Killed] StringLiteral
src/components/treeparent/TreeParent.tsx:59:20
     <ul
       // Stryker disable next-line StringLiteral
       key={"ul" + id}
-      data-testid={"treeParentCont" + id}
+      data-testid={"" + id}
       className={nodeOpen ? styles.active : styles.nested}
     >
killedBy: Buttons click tests collapse/expand all click
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeParentCont1000"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"
