[Killed] BooleanLiteral
src/components/viewerblock/ViewerBlock.tsx:22:58
 
   const [normal, setNormal] = useState("x")
   const [vectorLength, setVectorLength] = useState(1)
-  const [sectionsVisible, setSectionsVisible] = useState(false)
+  const [sectionsVisible, setSectionsVisible] = useState(true)
 
   useEffect(() => {
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/components/viewerblock/ViewerBlock.tsx:24:19
   const [vectorLength, setVectorLength] = useState(1)
   const [sectionsVisible, setSectionsVisible] = useState(false)
 
-  useEffect(() => {
-    // Stryker disable next-line ArrayDeclaration
-    let normalVector: number[] = []
-    switch (normal) {
-      case "x":
-        normalVector = [1, 0, 0]
-        break
-      case "y":
-        normalVector = [0, 1, 0]
-        break
-      case "z":
-        normalVector = [0, 0, 1]
-    }
-    dispatch(
-      changePlane({
-        plane: {
-          normal: normalVector,
-          sectionsVisible,
-          vectorLength,
-        },
-      })
-    )
-  }, [normal, vectorLength, sectionsVisible])
+  useEffect(() => {}, [normal, vectorLength, sectionsVisible])
 
   const onSelectStyle = (e: React.ChangeEvent<HTMLSelectElement>) => {
killedBy: ViewerBlock click tests show section click test
statusReason: TypeError: Cannot read properties of undefined (reading 'sectionsVisible')

[Killed] ConditionalExpression
src/components/viewerblock/ViewerBlock.tsx:28:7
     // Stryker disable next-line ArrayDeclaration
     let normalVector: number[] = []
     switch (normal) {
-      case "x":
-        normalVector = [1, 0, 0]
-        break
+      case "x":
       case "y":
         normalVector = [0, 1, 0]
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
    0,

[Killed] ArrayDeclaration
src/components/viewerblock/ViewerBlock.tsx:29:24
     let normalVector: number[] = []
     switch (normal) {
       case "x":
-        normalVector = [1, 0, 0]
+        normalVector = []
         break
       case "y":
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   1,
-   0,

[Killed] ConditionalExpression
src/components/viewerblock/ViewerBlock.tsx:31:7
       case "x":
         normalVector = [1, 0, 0]
         break
-      case "y":
-        normalVector = [0, 1, 0]
-        break
+      case "y":
       case "z":
         normalVector = [0, 0, 1]
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
-   1,

[Killed] ConditionalExpression
src/components/viewerblock/ViewerBlock.tsx:34:7
       case "y":
         normalVector = [0, 1, 0]
         break
-      case "z":
-        normalVector = [0, 0, 1]
+      case "z":
     }
     dispatch(
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   0,
-   0,

[Killed] ArrayDeclaration
src/components/viewerblock/ViewerBlock.tsx:46:6
         },
       })
     )
-  }, [normal, vectorLength, sectionsVisible])
+  }, [])
 
   const onSelectStyle = (e: React.ChangeEvent<HTMLSelectElement>) => {
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/components/viewerblock/ViewerBlock.tsx:48:70
     )
   }, [normal, vectorLength, sectionsVisible])
 
-  const onSelectStyle = (e: React.ChangeEvent<HTMLSelectElement>) => {
-    dispatch(changeMeshStyle({ meshStyle: e.target.value }))
-  }
+  const onSelectStyle = (e: React.ChangeEvent<HTMLSelectElement>) => {}
   const onSelectPerspective = (e: React.ChangeEvent<HTMLSelectElement>) => {
     dispatch(changeCamPosition({ camPosition: e.target.value }))
killedBy: ViewerBlock click tests mesh style selection test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "wireframe"
Received: "double"

[Killed] BlockStatement
src/components/viewerblock/ViewerBlock.tsx:51:76
   const onSelectStyle = (e: React.ChangeEvent<HTMLSelectElement>) => {
     dispatch(changeMeshStyle({ meshStyle: e.target.value }))
   }
-  const onSelectPerspective = (e: React.ChangeEvent<HTMLSelectElement>) => {
-    dispatch(changeCamPosition({ camPosition: e.target.value }))
-  }
+  const onSelectPerspective = (e: React.ChangeEvent<HTMLSelectElement>) => {}
   const onClickShowButton = () => {
     dispatch(changeTitleVisibility())
killedBy: ViewerBlock click tests cam position click test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "south"
Received: "top"

[Killed] BlockStatement
src/components/viewerblock/ViewerBlock.tsx:54:35
   const onSelectPerspective = (e: React.ChangeEvent<HTMLSelectElement>) => {
     dispatch(changeCamPosition({ camPosition: e.target.value }))
   }
-  const onClickShowButton = () => {
-    dispatch(changeTitleVisibility())
-  }
+  const onClickShowButton = () => {}
   const onVectorLengthChange = (x: React.ChangeEvent<HTMLInputElement>) => {
     setVectorLength(parseFloat(x.target.value))
killedBy: ViewerBlock click tests show names click test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/components/viewerblock/ViewerBlock.tsx:57:76
   const onClickShowButton = () => {
     dispatch(changeTitleVisibility())
   }
-  const onVectorLengthChange = (x: React.ChangeEvent<HTMLInputElement>) => {
-    setVectorLength(parseFloat(x.target.value))
-  }
+  const onVectorLengthChange = (x: React.ChangeEvent<HTMLInputElement>) => {}
   const onSelectVector = (e: React.ChangeEvent<HTMLSelectElement>) => {
     setNormal(e.target.value)
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
src/components/viewerblock/ViewerBlock.tsx:60:71
   const onVectorLengthChange = (x: React.ChangeEvent<HTMLInputElement>) => {
     setVectorLength(parseFloat(x.target.value))
   }
-  const onSelectVector = (e: React.ChangeEvent<HTMLSelectElement>) => {
-    setNormal(e.target.value)
-  }
+  const onSelectVector = (e: React.ChangeEvent<HTMLSelectElement>) => {}
   const onClickSectionButton = () => {
     setSectionsVisible((prev) => !prev)
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   1,
    0,

[Killed] BlockStatement
src/components/viewerblock/ViewerBlock.tsx:63:38
   const onSelectVector = (e: React.ChangeEvent<HTMLSelectElement>) => {
     setNormal(e.target.value)
   }
-  const onClickSectionButton = () => {
-    setSectionsVisible((prev) => !prev)
-  }
+  const onClickSectionButton = () => {}
   const widgets = [
     <div key="label">Параметры сечения: </div>,
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ArrowFunction
src/components/viewerblock/ViewerBlock.tsx:64:24
     setNormal(e.target.value)
   }
   const onClickSectionButton = () => {
-    setSectionsVisible((prev) => !prev)
+    setSectionsVisible(() => undefined)
   }
   const widgets = [
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] BooleanLiteral
src/components/viewerblock/ViewerBlock.tsx:64:34
     setNormal(e.target.value)
   }
   const onClickSectionButton = () => {
-    setSectionsVisible((prev) => !prev)
+    setSectionsVisible((prev) => prev)
   }
   const widgets = [
killedBy: ViewerBlock click tests show section click test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] StringLiteral
src/components/viewerblock/ViewerBlock.tsx:98:18
     <div
       key="section"
       data-testid="section"
-      className={`${styles.titleButton} ${styles.showSection}`}
+      className={``}
       onClick={onClickSectionButton}
       title="Показать сечения"
killedBy: ViewerBlock render tests render empty ViewerBlock test
statusReason: Error: expect(element).toHaveClass("titleButton")

Expected the element to have class:
  titleButton
Received:

[Killed] ArrowFunction
src/components/viewerblock/ViewerBlock.tsx:109:25
         onChange={onSelectStyle}
         defaultValue={ViewStyle.DOUBLE}
       >
-        {viewStyles.map((style) => (
-          <option data-testid={style.id} key={style.id} value={style.id}>
-            {style.name}
-          </option>
-        ))}
+        {viewStyles.map(() => undefined)}
       </select>
     </div>,
killedBy: ViewerBlock click tests mesh style selection test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="wireframe"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="viewerBlock"
      data-testid="viewerBlock"

[Killed] ArrowFunction
src/components/viewerblock/ViewerBlock.tsx:123:27
         onChange={onSelectPerspective}
         defaultValue={Perspective.TOP}
       >
-        {perspectives.map((p) => (
-          <option data-testid={p.id}  key={p.id} value={p.id}>
-            {p.name}
-          </option>
-        ))}
+        {perspectives.map(() => undefined)}
       </select>
     </div>,
killedBy: ViewerBlock click tests cam position click test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="south"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="viewerBlock"
      data-testid="viewerBlock"
