[Killed] ArrowFunction
src/threejs/mesh/ModelMesh.tsx:15:26
 
 export const ModelMesh = ({ color, vertices, style }: ModelMeshProps) => {
   // Stryker disable next-line ArrayDeclaration
-  const points = useMemo(() => new Float32Array(vertices), [])
+  const points = useMemo(() => undefined, [])
   const update = useCallback(
     (
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ArrowFunction
src/threejs/mesh/ModelMesh.tsx:17:5
   // Stryker disable next-line ArrayDeclaration
   const points = useMemo(() => new Float32Array(vertices), [])
   const update = useCallback(
-    (
-      self: ExtendedColors<
-        Overwrite<THREE.BufferGeometry, NodeProps<THREE.BufferGeometry, any>>
-      >
-    ) => self.computeVertexNormals(),
+    () => undefined,
     []
   )

[Survived] ArithmeticOperator
src/threejs/mesh/ModelMesh.tsx:29:16
       <bufferAttribute
         attach="attributes-position"
         array={points}
-        count={points.length / 3}
+        count={points.length * 3}
         itemSize={3}
       />

[Killed] BlockStatement
src/threejs/mesh/ModelMesh.tsx:34:34
       />
     </bufferGeometry>
   )
-  if (style === ViewStyle.POINT) {
-    return (
-      <points>
-        {geometry}
-        <pointsMaterial color={color} size={5} sizeAttenuation />
-      </points>
-    )
-  }
+  if (style === ViewStyle.POINT) {}
   if (style === ViewStyle.CIRCLE) {
     return (
killedBy: mesh point material
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: undefined

[Killed] ConditionalExpression
src/threejs/mesh/ModelMesh.tsx:34:7
       />
     </bufferGeometry>
   )
-  if (style === ViewStyle.POINT) {
+  if (true) {
     return (
       <points>
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ConditionalExpression
src/threejs/mesh/ModelMesh.tsx:42:7
       </points>
     )
   }
-  if (style === ViewStyle.CIRCLE) {
+  if (false) {
     return (
       <points>
killedBy: mesh circle material
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CirclePointMaterial"
Received: undefined

[Killed] ConditionalExpression
src/threejs/mesh/ModelMesh.tsx:42:7
       </points>
     )
   }
-  if (style === ViewStyle.CIRCLE) {
+  if (true) {
     return (
       <points>
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "#FF0000"
Received: undefined

[Killed] EqualityOperator
src/threejs/mesh/ModelMesh.tsx:56:15
       <meshStandardMaterial
         attach="material"
         color={color}
-        side={style === ViewStyle.SINGLE ? THREE.FrontSide : THREE.DoubleSide}
+        side={style !== ViewStyle.SINGLE ? THREE.FrontSide : THREE.DoubleSide}
         wireframe={style === ViewStyle.WIREFRAME}
         opacity={0.7}
killedBy: mesh double side material
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] ConditionalExpression
src/threejs/mesh/ModelMesh.tsx:56:15
       <meshStandardMaterial
         attach="material"
         color={color}
-        side={style === ViewStyle.SINGLE ? THREE.FrontSide : THREE.DoubleSide}
+        side={true ? THREE.FrontSide : THREE.DoubleSide}
         wireframe={style === ViewStyle.WIREFRAME}
         opacity={0.7}
killedBy: mesh double side material
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] EqualityOperator
src/threejs/mesh/ModelMesh.tsx:57:20
         attach="material"
         color={color}
         side={style === ViewStyle.SINGLE ? THREE.FrontSide : THREE.DoubleSide}
-        wireframe={style === ViewStyle.WIREFRAME}
+        wireframe={style !== ViewStyle.WIREFRAME}
         opacity={0.7}
         transparent={style === ViewStyle.OPACITY}
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/threejs/mesh/ModelMesh.tsx:57:20
         attach="material"
         color={color}
         side={style === ViewStyle.SINGLE ? THREE.FrontSide : THREE.DoubleSide}
-        wireframe={style === ViewStyle.WIREFRAME}
+        wireframe={true}
         opacity={0.7}
         transparent={style === ViewStyle.OPACITY}
killedBy: mesh double side material
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/threejs/mesh/ModelMesh.tsx:59:22
         side={style === ViewStyle.SINGLE ? THREE.FrontSide : THREE.DoubleSide}
         wireframe={style === ViewStyle.WIREFRAME}
         opacity={0.7}
-        transparent={style === ViewStyle.OPACITY}
+        transparent={true}
       />
     </mesh>
killedBy: mesh double side material
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/threejs/mesh/ModelMesh.tsx:59:22
         side={style === ViewStyle.SINGLE ? THREE.FrontSide : THREE.DoubleSide}
         wireframe={style === ViewStyle.WIREFRAME}
         opacity={0.7}
-        transparent={style === ViewStyle.OPACITY}
+        transparent={false}
       />
     </mesh>
killedBy: mesh transparent material
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
