[Killed] BlockStatement
src/threejs/sections/Sections.tsx:11:63
   plane: THREE.Plane
 }
 
-export const Sections = ({ models, plane }: SectionsProps) => {
-  const geometries: number[][] = models
-    .filter((m) => m.triangulation)
-    .map((m) => m.triangulation)
-  const sections = createSection(geometries, plane)
-  return (
-    <group>
-      {sections.map((section, index) => (
-        // Stryker disable next-line StringLiteral
-        <Section key={"section" + index} section={section} />
-      ))}
-    </group>
-  )
-}
+export const Sections = ({ models, plane }: SectionsProps) => {}
 
killedBy: Viewer render test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

[Killed] MethodExpression
src/threejs/sections/Sections.tsx:12:34
 }
 
 export const Sections = ({ models, plane }: SectionsProps) => {
-  const geometries: number[][] = models
-    .filter((m) => m.triangulation)
+  const geometries: number[][] = models
     .map((m) => m.triangulation)
   const sections = createSection(geometries, plane)
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/threejs/sections/Sections.tsx:13:13
 
 export const Sections = ({ models, plane }: SectionsProps) => {
   const geometries: number[][] = models
-    .filter((m) => m.triangulation)
+    .filter(() => undefined)
     .map((m) => m.triangulation)
   const sections = createSection(geometries, plane)
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ArrowFunction
src/threejs/sections/Sections.tsx:14:10
 export const Sections = ({ models, plane }: SectionsProps) => {
   const geometries: number[][] = models
     .filter((m) => m.triangulation)
-    .map((m) => m.triangulation)
+    .map(() => undefined)
   const sections = createSection(geometries, plane)
   return (
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/threejs/sections/Sections.tsx:18:21
   const sections = createSection(geometries, plane)
   return (
     <group>
-      {sections.map((section, index) => (
-        // Stryker disable next-line StringLiteral
-        <Section key={"section" + index} section={section} />
-      ))}
+      {sections.map(() => undefined)}
     </group>
   )
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')
