[Killed] BlockStatement
src/components/buttonpanel/ButtonPanel.tsx:14:7
   children,
   title,
   style,
-}) => {
-  return (
-    <div className={styles.buttonPanel} style={style} data-testid={"btnPanel"}>
-      {title ? <div className={styles.panelTitle}>{title}</div> : <></>}
-      {children}
-    </div>
-  )
-}
+}) => {}
 
killedBy: ViewerBlock render tests render empty ViewerBlock test
statusReason: TestingLibraryElementError: Unable to find an element with the text: Визуализация. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="viewerBlock"
      data-testid="viewerBlock"
