[Killed] BooleanLiteral
src/components/modelblock/ModelBlock.tsx:17:64
 export const ModelBlock = ({}: ModelBlockProps) => {
   const dispatch = useDispatch()
 
-  const [isAttributesVisible, setAttributesVisible] = useState(true)
+  const [isAttributesVisible, setAttributesVisible] = useState(false)
   useEffect(() => {
     dispatch(isAttributesVisible ? show() : hide())
killedBy: ModelBlock render tests render empty ModelBlock test
statusReason: TestingLibraryElementError: Unable to find an element with the text: Атрибуты модели. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[Killed] BlockStatement
src/components/modelblock/ModelBlock.tsx:18:19
   const dispatch = useDispatch()
 
   const [isAttributesVisible, setAttributesVisible] = useState(true)
-  useEffect(() => {
-    dispatch(isAttributesVisible ? show() : hide())
-  }, [isAttributesVisible])
+  useEffect(() => {}, [isAttributesVisible])
   const formState = useSelector<AppStateType, ModelLoadSliceState>(
     modelDataState
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/components/modelblock/ModelBlock.tsx:24:35
   const formState = useSelector<AppStateType, ModelLoadSliceState>(
     modelDataState
   )
-  const onClickShowButton = () => {
-    setAttributesVisible((prev) => !prev)
-  }
+  const onClickShowButton = () => {}
   const onClickExpandButton = () => {
     dispatch(expand())
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toBeNull()

Received: <div class="panelTitle">Параметры модели</div>

[Killed] ArrowFunction
src/components/modelblock/ModelBlock.tsx:25:26
     modelDataState
   )
   const onClickShowButton = () => {
-    setAttributesVisible((prev) => !prev)
+    setAttributesVisible(() => undefined)
   }
   const onClickExpandButton = () => {
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/components/modelblock/ModelBlock.tsx:25:36
     modelDataState
   )
   const onClickShowButton = () => {
-    setAttributesVisible((prev) => !prev)
+    setAttributesVisible((prev) => prev)
   }
   const onClickExpandButton = () => {
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toBeNull()

Received: <div class="panelTitle">Параметры модели</div>

[Killed] BlockStatement
src/components/modelblock/ModelBlock.tsx:27:37
   const onClickShowButton = () => {
     setAttributesVisible((prev) => !prev)
   }
-  const onClickExpandButton = () => {
-    dispatch(expand())
-  }
+  const onClickExpandButton = () => {}
   const onClickCollapseButton = () => {
     dispatch(collapse())
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  nested

[Killed] BlockStatement
src/components/modelblock/ModelBlock.tsx:30:39
   const onClickExpandButton = () => {
     dispatch(expand())
   }
-  const onClickCollapseButton = () => {
-    dispatch(collapse())
-  }
+  const onClickCollapseButton = () => {}
   const btnStyle = `${styles.blockButton}`
   const buttons = [
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("nested")

Expected the element to have class:
  nested
Received:
  active

[Survived] StringLiteral
src/components/modelblock/ModelBlock.tsx:36:12
   const btnStyle = `${styles.blockButton}`
   const buttons = [
     <div
-      key={"show"}
+      key={""}
       data-testid="show"
       className={

[Killed] StringLiteral
src/components/modelblock/ModelBlock.tsx:46:13
       onClick={onClickShowButton}
       title={
         isAttributesVisible
-          ? "Скрыть блок атрибутов"
+          ? ""
           : "Показать блок атрибутов"
       }
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Скрыть блок атрибутов"
Received: ""

[Killed] StringLiteral
src/components/modelblock/ModelBlock.tsx:47:13
       title={
         isAttributesVisible
           ? "Скрыть блок атрибутов"
-          : "Показать блок атрибутов"
+          : ""
       }
     ></div>,
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Показать блок атрибутов"
Received: ""

[Killed] StringLiteral
src/components/modelblock/ModelBlock.tsx:53:18
     <div
       key={"expandTree"}
       data-testid="expandTree"
-      className={`${btnStyle} ${styles.expand}`}
+      className={``}
       onClick={onClickExpandButton}
       title="Развернуть"
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("expand")

Expected the element to have class:
  expand
Received:

[Killed] StringLiteral
src/components/modelblock/ModelBlock.tsx:60:18
     <div
       key={"collapseTree"}
       data-testid="collapseTree"
-      className={`${btnStyle} ${styles.collapse}`}
+      className={``}
       onClick={onClickCollapseButton}
       title="Свернуть"
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("collapse")

Expected the element to have class:
  collapse
Received:

[Killed] StringLiteral
src/components/modelblock/ModelBlock.tsx:72:25
         key={"modelTreeBlock"}
         title="Список моделей"
         widgets={buttons}
-        style={{ width: "400px" }}
+        style={{ width: "" }}
       >
         <div
killedBy: ModelBlock render tests render ModelBlock with loaded tree test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "400px"
Received: ""

[Killed] ObjectLiteral
src/components/modelblock/ModelBlock.tsx:72:16
         key={"modelTreeBlock"}
         title="Список моделей"
         widgets={buttons}
-        style={{ width: "400px" }}
+        style={{}}
       >
         <div
killedBy: ModelBlock render tests render ModelBlock with loaded tree test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "400px"
Received: ""

[Killed] BooleanLiteral
src/components/modelblock/ModelBlock.tsx:80:25
             isAttributesVisible ? styles.treePanelShort : styles.treePanelLong
           }
         >
-          {formState && !formState.isLoading && formState.isSuccess ? (
+          {formState && formState.isLoading && formState.isSuccess ? (
             <ModelTree key="modelTree" models={formState.value} />
           ) : (
killedBy: ModelBlock render tests render empty ModelBlock test
statusReason: Error: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.

[Killed] LogicalOperator
src/components/modelblock/ModelBlock.tsx:80:12
             isAttributesVisible ? styles.treePanelShort : styles.treePanelLong
           }
         >
-          {formState && !formState.isLoading && formState.isSuccess ? (
+          {formState && !formState.isLoading || formState.isSuccess ? (
             <ModelTree key="modelTree" models={formState.value} />
           ) : (
killedBy: ModelBlock render tests render empty ModelBlock test
statusReason: Error: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.
