[Killed] BlockStatement
src/components/treeleaf/TreeLeaf.tsx:19:7
   onCheckboxClick,
   isChecked,
   onRowClick,
-}) => {
-  return (
-    <li id={id} key={id} data-testid="treeLeaf">
-      <Checkbox onClick={onCheckboxClick} initialState={isChecked} />
-      <label
-        data-testid="treeLeafLabel"
-        onClick={onRowClick}
-        className={styles.leaf}
-      >
-        {name}
-      </label>
-    </li>
-  )
-}
+}) => {}
 
killedBy: TreeParent render tests render open TreeParent test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeLeaf"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <li
      class="treeNode"
      data-testid="treeParent1"
