[Killed] BlockStatement
simple-viewer/src/redux/attributeSlice.ts:6:55
 export type ActionType = PayloadAction<{
   isOpen: boolean
 }>
-export const onShow = (state: AttributeSliceState) => {
-  state.isVisible = true
-}
+export const onShow = (state: AttributeSliceState) => {}
 export const onHide = (state: AttributeSliceState) => {
   state.isVisible = false
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
simple-viewer/src/redux/attributeSlice.ts:7:21
   isOpen: boolean
 }>
 export const onShow = (state: AttributeSliceState) => {
-  state.isVisible = true
+  state.isVisible = false
 }
 export const onHide = (state: AttributeSliceState) => {
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
simple-viewer/src/redux/attributeSlice.ts:9:55
 export const onShow = (state: AttributeSliceState) => {
   state.isVisible = true
 }
-export const onHide = (state: AttributeSliceState) => {
-  state.isVisible = false
-}
+export const onHide = (state: AttributeSliceState) => {}
 
 export const attributeSlice = createSlice({
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
simple-viewer/src/redux/attributeSlice.ts:10:21
   state.isVisible = true
 }
 export const onHide = (state: AttributeSliceState) => {
-  state.isVisible = false
+  state.isVisible = true
 }
 
killedBy: Buttons click tests show attr click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
