[Killed] BlockStatement
simple-viewer/src/redux/checkboxSlice.ts:12:74
   cellState?: number
 }>
 
-export const onInit = (state: CheckboxSliceState, action: ActionType) => {
-  state.value = action.payload.checks ? action.payload.checks : []
-  state.tree = action.payload.tree ? action.payload.tree : []
-}
+export const onInit = (state: CheckboxSliceState, action: ActionType) => {}
 export const onUpdateCell = (state: CheckboxSliceState, action: ActionType) => {
   state.value = propagate(
killedBy: ModelTree render tests render ModelTree test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="checkbox"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <ul
      class="ul"
      data-testid="modelTree"

[Killed] ArrayDeclaration
simple-viewer/src/redux/checkboxSlice.ts:14:60
 
 export const onInit = (state: CheckboxSliceState, action: ActionType) => {
   state.value = action.payload.checks ? action.payload.checks : []
-  state.tree = action.payload.tree ? action.payload.tree : []
+  state.tree = action.payload.tree ? action.payload.tree : ["Stryker was here"]
 }
 export const onUpdateCell = (state: CheckboxSliceState, action: ActionType) => {
killedBy: checkboxSlice states tests init empty state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "tree": Array [],
+   "tree": Array [

[Killed] BlockStatement
simple-viewer/src/redux/checkboxSlice.ts:16:80
   state.value = action.payload.checks ? action.payload.checks : []
   state.tree = action.payload.tree ? action.payload.tree : []
 }
-export const onUpdateCell = (state: CheckboxSliceState, action: ActionType) => {
-  state.value = propagate(
-    state.tree,
-    state.value,
-    action.payload.cellIndex,
-    action.payload.cellState
-  )
-}
+export const onUpdateCell = (state: CheckboxSliceState, action: ActionType) => {}
 export const onClear = (state: CheckboxSliceState) => {
   state.value = []
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] BlockStatement
simple-viewer/src/redux/checkboxSlice.ts:24:55
     action.payload.cellState
   )
 }
-export const onClear = (state: CheckboxSliceState) => {
-  state.value = []
-  state.tree = []
-}
+export const onClear = (state: CheckboxSliceState) => {}
 
 export const checkboxSlice = createSlice({
killedBy: checkboxSlice states tests clear state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  2
+ Received  + 10

  Object {
-   "tree": Array [],
-   "value": Array [],

[Killed] ArrayDeclaration
simple-viewer/src/redux/checkboxSlice.ts:25:17
   )
 }
 export const onClear = (state: CheckboxSliceState) => {
-  state.value = []
+  state.value = ["Stryker was here"]
   state.tree = []
 }
killedBy: checkboxSlice states tests clear state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
    "tree": Array [],
-   "value": Array [],
