[Killed] BlockStatement
simple-viewer/src/redux/loadAttributesSlice.ts:18:6
 export const onLoadStart = (
   state: ModelAttributesSliceState,
   action: ActionType
-) => {
-  state.isLoading = true
-  state.modelId = action.payload.modelId
-}
+) => {}
 export const onLoadSuccess = (
   state: ModelAttributesSliceState,
killedBy: loadAttributesSlice states tests fetchAttributeData state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Object {
    "isLoading": true,
    "isSuccess": true,

[Killed] BooleanLiteral
simple-viewer/src/redux/loadAttributesSlice.ts:19:21
   state: ModelAttributesSliceState,
   action: ActionType
 ) => {
-  state.isLoading = true
+  state.isLoading = false
   state.modelId = action.payload.modelId
 }
killedBy: ModelBlock render tests render empty ModelBlock test
statusReason: TestingLibraryElementError: Unable to find an element with the text: Атрибуты модели. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[Killed] BlockStatement
simple-viewer/src/redux/loadAttributesSlice.ts:25:6
 export const onLoadSuccess = (
   state: ModelAttributesSliceState,
   action: ActionType
-) => {
-  state.value = action.payload.attributes
-  state.isLoading = false
-  state.isSuccess = true
-}
+) => {}
 
 export const onLoadFailure = (state: ModelAttributesSliceState) => {
killedBy: loadAttributesSlice states tests fetchAttributeDataFinished state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

  Object {
-   "isLoading": false,
+   "isLoading": true,

[Killed] BooleanLiteral
simple-viewer/src/redux/loadAttributesSlice.ts:27:21
   action: ActionType
 ) => {
   state.value = action.payload.attributes
-  state.isLoading = false
+  state.isLoading = true
   state.isSuccess = true
 }
killedBy: loadAttributesSlice states tests fetchAttributeDataFinished state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "isLoading": false,

[Killed] BooleanLiteral
simple-viewer/src/redux/loadAttributesSlice.ts:28:21
 ) => {
   state.value = action.payload.attributes
   state.isLoading = false
-  state.isSuccess = true
+  state.isSuccess = false
 }
 
killedBy: loadAttributesSlice states tests fetchAttributeDataFinished state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Object {
    "isLoading": false,

[Killed] BlockStatement
simple-viewer/src/redux/loadAttributesSlice.ts:31:68
   state.isSuccess = true
 }
 
-export const onLoadFailure = (state: ModelAttributesSliceState) => {
-  state.isLoading = false
-  state.isSuccess = false
-}
+export const onLoadFailure = (state: ModelAttributesSliceState) => {}
 export const attributeLoadSlice = createSlice({
   name: "modelAttributeFakeLoad",
killedBy: loadAttributesSlice states tests fetchAttributeDataFailed state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "isLoading": false,
-   "isSuccess": false,

[Killed] BooleanLiteral
simple-viewer/src/redux/loadAttributesSlice.ts:32:21
 }
 
 export const onLoadFailure = (state: ModelAttributesSliceState) => {
-  state.isLoading = false
+  state.isLoading = true
   state.isSuccess = false
 }
killedBy: loadAttributesSlice states tests fetchAttributeDataFailed state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "isLoading": false,
+   "isLoading": true,

[Killed] BooleanLiteral
simple-viewer/src/redux/loadAttributesSlice.ts:33:21
 
 export const onLoadFailure = (state: ModelAttributesSliceState) => {
   state.isLoading = false
-  state.isSuccess = false
+  state.isSuccess = true
 }
 export const attributeLoadSlice = createSlice({
killedBy: loadAttributesSlice states tests fetchAttributeDataFailed state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "isLoading": false,
-   "isSuccess": false,
