[Killed] BlockStatement
simple-viewer/src/redux/loadModelSlice.ts:12:60
   models: Model[]
 }>
 
-export const onLoadStart = (state: ModelLoadSliceState) => {
-  state.isLoading = true
-}
+export const onLoadStart = (state: ModelLoadSliceState) => {}
 
 export const onLoadSuccess = (
killedBy: modelLoadSlice states tests fetchData state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "isLoading": true,
+   "isLoading": false,

[Killed] BooleanLiteral
simple-viewer/src/redux/loadModelSlice.ts:13:21
 }>
 
 export const onLoadStart = (state: ModelLoadSliceState) => {
-  state.isLoading = true
+  state.isLoading = false
 }
 
killedBy: App render tests render APP test
statusReason: Error: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.

[Killed] BlockStatement
simple-viewer/src/redux/loadModelSlice.ts:19:6
 export const onLoadSuccess = (
   state: ModelLoadSliceState,
   action: ActionType
-) => {
-  state.value = action.payload.models
-  state.isLoading = false
-  state.isSuccess = true
-}
+) => {}
 
 export const onLoadFailure = (state: ModelLoadSliceState) => {
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >

[Killed] BooleanLiteral
simple-viewer/src/redux/loadModelSlice.ts:21:21
   action: ActionType
 ) => {
   state.value = action.payload.models
-  state.isLoading = false
+  state.isLoading = true
   state.isSuccess = true
 }
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >

[Killed] BlockStatement
simple-viewer/src/redux/loadModelSlice.ts:25:62
   state.isSuccess = true
 }
 
-export const onLoadFailure = (state: ModelLoadSliceState) => {
-  state.isLoading = false
-  state.isSuccess = false
-}
+export const onLoadFailure = (state: ModelLoadSliceState) => {}
 
 export const loadModelSlice = createSlice({
killedBy: modelLoadSlice states tests fetchFailure state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
-   "isLoading": false,
-   "isSuccess": false,

[Killed] BooleanLiteral
simple-viewer/src/redux/loadModelSlice.ts:26:21
 }
 
 export const onLoadFailure = (state: ModelLoadSliceState) => {
-  state.isLoading = false
+  state.isLoading = true
   state.isSuccess = false
 }
killedBy: modelLoadSlice states tests fetchFailure state test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "isLoading": false,
+   "isLoading": true,

[Killed] ObjectLiteral
simple-viewer/src/redux/loadModelSlice.ts:37:13
     isLoading: true,
     isSuccess: true,
   } as ModelLoadSliceState,
-  reducers: {
-    fetchData: onLoadStart,
-    fetchFinished: onLoadSuccess,
-    fetchFailure: onLoadFailure,
-  },
+  reducers: {},
 })
 export const { fetchData, fetchFinished, fetchFailure } = loadModelSlice.actions
killedBy: App render tests render APP test
statusReason: TypeError: (0 , _loadModelSlice.fetchData) is not a function
