[Killed] BlockStatement
simple-viewer/src/redux/store.ts:41:75
   visualBlockData: VisualBlockStateSliceReducer,
 })
 
-export const setupStore = (preloadedState?: PreloadedState<RootState>) => {
-  return configureStore({
-    reducer: rootReducer,
-    preloadedState,
-    middleware: (getDefaultMiddleware) =>
-      getDefaultMiddleware().concat(sagaMiddleware),
-  })
-}
+export const setupStore = (preloadedState?: PreloadedState<RootState>) => {}
 
 export default configureStore({
killedBy: ModelTree render tests render ModelTree test
statusReason: TypeError: Cannot read properties of undefined (reading 'getState')

[Killed] ArrowFunction
simple-viewer/src/redux/store.ts:45:17
   return configureStore({
     reducer: rootReducer,
     preloadedState,
-    middleware: (getDefaultMiddleware) =>
-      getDefaultMiddleware().concat(sagaMiddleware),
+    middleware: () => undefined,
   })
 }
killedBy: ModelTree render tests render ModelTree test
statusReason: Error: when using a middleware builder function, an array of middleware must be returned

[Killed] ArrowFunction
simple-viewer/src/redux/store.ts:58:35
 
 sagaMiddleware.run(rootSaga)
 export type RootState = ReturnType<typeof rootReducer>
-export const treeSelectionState = (state: AppStateType) => state.treeSelection
+export const treeSelectionState = () => undefined
 export const modelDataState = (state: AppStateType) => state.modelData
 export const checkboxState = (state: AppStateType) => state.checks
killedBy: ModelBlock render tests render empty ModelBlock test
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] ArrowFunction
simple-viewer/src/redux/store.ts:59:31
 sagaMiddleware.run(rootSaga)
 export type RootState = ReturnType<typeof rootReducer>
 export const treeSelectionState = (state: AppStateType) => state.treeSelection
-export const modelDataState = (state: AppStateType) => state.modelData
+export const modelDataState = () => undefined
 export const checkboxState = (state: AppStateType) => state.checks
 export const treeNodesState = (state: AppStateType) => state.treeNodes
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >

[Killed] ArrowFunction
simple-viewer/src/redux/store.ts:60:30
 export type RootState = ReturnType<typeof rootReducer>
 export const treeSelectionState = (state: AppStateType) => state.treeSelection
 export const modelDataState = (state: AppStateType) => state.modelData
-export const checkboxState = (state: AppStateType) => state.checks
+export const checkboxState = () => undefined
 export const treeNodesState = (state: AppStateType) => state.treeNodes
 export const attributeState = (state: AppStateType) => state.attributeVisibility
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'tree')

[Killed] ArrowFunction
simple-viewer/src/redux/store.ts:61:31
 export const treeSelectionState = (state: AppStateType) => state.treeSelection
 export const modelDataState = (state: AppStateType) => state.modelData
 export const checkboxState = (state: AppStateType) => state.checks
-export const treeNodesState = (state: AppStateType) => state.treeNodes
+export const treeNodesState = () => undefined
 export const attributeState = (state: AppStateType) => state.attributeVisibility
 export const attributeFakeDataState = (state: AppStateType) =>
killedBy: ModelTree render tests render ModelTree test
statusReason: TypeError: Cannot read properties of undefined (reading 'isOpen')

[Survived] ArrowFunction
simple-viewer/src/redux/store.ts:62:31
 export const modelDataState = (state: AppStateType) => state.modelData
 export const checkboxState = (state: AppStateType) => state.checks
 export const treeNodesState = (state: AppStateType) => state.treeNodes
-export const attributeState = (state: AppStateType) => state.attributeVisibility
+export const attributeState = () => undefined
 export const attributeFakeDataState = (state: AppStateType) =>
   state.attributeFakeData

[Survived] ArrowFunction
simple-viewer/src/redux/store.ts:63:39
 export const checkboxState = (state: AppStateType) => state.checks
 export const treeNodesState = (state: AppStateType) => state.treeNodes
 export const attributeState = (state: AppStateType) => state.attributeVisibility
-export const attributeFakeDataState = (state: AppStateType) =>
-  state.attributeFakeData
+export const attributeFakeDataState = () => undefined
 export const visualBlockDataState = (state: AppStateType) => state.visualBlockData

[Killed] ArrowFunction
simple-viewer/src/redux/store.ts:65:37
 export const attributeState = (state: AppStateType) => state.attributeVisibility
 export const attributeFakeDataState = (state: AppStateType) =>
   state.attributeFakeData
-export const visualBlockDataState = (state: AppStateType) => state.visualBlockData
+export const visualBlockDataState = () => undefined
killedBy: App render tests render APP test
statusReason: TypeError: Cannot read properties of undefined (reading 'plane')
