[Killed] BlockStatement
simple-viewer/src/redux/treeSelectionSlice.ts:10:6
 export const onSelect = (
   state: TreeSelectionSliceState,
   action: ActionType
-) => {
-  state.value = action.payload.modelId
-}
+) => {}
 export const onClear = (state: TreeSelectionSliceState) => {
   state.value = undefined
killedBy: click tests detail click test
statusReason: Error: expect(received).not.toBeUndefined()

Received: undefined

[Killed] BlockStatement
simple-viewer/src/redux/treeSelectionSlice.ts:13:60
 ) => {
   state.value = action.payload.modelId
 }
-export const onClear = (state: TreeSelectionSliceState) => {
-  state.value = undefined
-}
+export const onClear = (state: TreeSelectionSliceState) => {}
 
 export const treeSelectionSlice = createSlice({
killedBy: treeSelectionSlice states tests clear state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Object {}
+ Object {
+   "value": 1,

[Killed] ObjectLiteral
simple-viewer/src/redux/treeSelectionSlice.ts:20:13
 export const treeSelectionSlice = createSlice({
   name: "treeSelection",
   initialState: {} as TreeSelectionSliceState,
-  reducers: {
-    select: onSelect,
-    clear: onClear,
-  },
+  reducers: {},
 })
 export const { select, clear } = treeSelectionSlice.actions
killedBy: click tests detail click test
statusReason: TypeError: (0 , _treeSelectionSlice.select) is not a function
