[Killed] BlockStatement
simple-viewer/src/redux/treeSlice.ts:6:52
 export type ActionType = PayloadAction<{
   isOpen: boolean
 }>
-export const onExpand = (state: TreeSliceState) => {
-  state.isOpen = true
-}
+export const onExpand = (state: TreeSliceState) => {}
 export const onCollapse = (state: TreeSliceState) => {
   state.isOpen = false
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  nested

[Killed] BooleanLiteral
simple-viewer/src/redux/treeSlice.ts:7:18
   isOpen: boolean
 }>
 export const onExpand = (state: TreeSliceState) => {
-  state.isOpen = true
+  state.isOpen = false
 }
 export const onCollapse = (state: TreeSliceState) => {
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("active")

Expected the element to have class:
  active
Received:
  nested

[Killed] BlockStatement
simple-viewer/src/redux/treeSlice.ts:9:54
 export const onExpand = (state: TreeSliceState) => {
   state.isOpen = true
 }
-export const onCollapse = (state: TreeSliceState) => {
-  state.isOpen = false
-}
+export const onCollapse = (state: TreeSliceState) => {}
 
 export const treeSlice = createSlice({
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("nested")

Expected the element to have class:
  nested
Received:
  active

[Killed] BooleanLiteral
simple-viewer/src/redux/treeSlice.ts:10:18
   state.isOpen = true
 }
 export const onCollapse = (state: TreeSliceState) => {
-  state.isOpen = false
+  state.isOpen = true
 }
 
killedBy: Buttons click tests collapse/expand all click
statusReason: Error: expect(element).toHaveClass("nested")

Expected the element to have class:
  nested
Received:
  active

[Killed] ObjectLiteral
simple-viewer/src/redux/treeSlice.ts:18:13
   initialState: {
     isOpen: true,
   } as TreeSliceState,
-  reducers: {
-    expand: onExpand,
-    collapse: onCollapse,
-  },
+  reducers: {},
 })
 export const { expand, collapse } = treeSlice.actions
killedBy: treeSlice states tests expand state test
statusReason: TypeError: (0 , _treeSlice.expand) is not a function
