[Killed] BlockStatement
simple-viewer/src/redux/visualBlockSlice.ts:23:76
   plane?: PlaneDataType
 }>
 
-const onChangeMeshStyle = (state: VisualBlockState, action: ActionType) => {
-  if (action.payload.meshStyle) {
-    state.meshStyle = action.payload.meshStyle
-  }
-}
+const onChangeMeshStyle = (state: VisualBlockState, action: ActionType) => {}
 
 const onChangeCamPosition = (state: VisualBlockState, action: ActionType) => {
killedBy: ViewerBlock click tests mesh style selection test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "wireframe"
Received: "double"

[Killed] ConditionalExpression
simple-viewer/src/redux/visualBlockSlice.ts:24:7
 }>
 
 const onChangeMeshStyle = (state: VisualBlockState, action: ActionType) => {
-  if (action.payload.meshStyle) {
+  if (false) {
     state.meshStyle = action.payload.meshStyle
   }
killedBy: ViewerBlock click tests mesh style selection test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "wireframe"
Received: "double"

[Killed] BlockStatement
simple-viewer/src/redux/visualBlockSlice.ts:24:33
 }>
 
 const onChangeMeshStyle = (state: VisualBlockState, action: ActionType) => {
-  if (action.payload.meshStyle) {
-    state.meshStyle = action.payload.meshStyle
-  }
+  if (action.payload.meshStyle) {}
 }
 
killedBy: ViewerBlock click tests mesh style selection test
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: "wireframe"
Received: "double"

[Killed] BlockStatement
simple-viewer/src/redux/visualBlockSlice.ts:29:78
   }
 }
 
-const onChangeCamPosition = (state: VisualBlockState, action: ActionType) => {
-  if (action.payload.camPosition) {
-    state.camPosition = action.payload.camPosition
-  }
-}
+const onChangeCamPosition = (state: VisualBlockState, action: ActionType) => {}
 
 const onChangeTitleVisibility = (state: VisualBlockState) => {
killedBy: ViewerBlock click tests cam position click test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "south"
Received: "top"

[Killed] BlockStatement
simple-viewer/src/redux/visualBlockSlice.ts:30:35
 }
 
 const onChangeCamPosition = (state: VisualBlockState, action: ActionType) => {
-  if (action.payload.camPosition) {
-    state.camPosition = action.payload.camPosition
-  }
+  if (action.payload.camPosition) {}
 }
 
killedBy: ViewerBlock click tests cam position click test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "south"
Received: "top"

[Killed] ConditionalExpression
simple-viewer/src/redux/visualBlockSlice.ts:30:7
 }
 
 const onChangeCamPosition = (state: VisualBlockState, action: ActionType) => {
-  if (action.payload.camPosition) {
+  if (false) {
     state.camPosition = action.payload.camPosition
   }
killedBy: viewerSlice states tests changeCamPosition state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "camPosition": "bottom",
+   "camPosition": "top",

[Killed] BlockStatement
simple-viewer/src/redux/visualBlockSlice.ts:35:62
   }
 }
 
-const onChangeTitleVisibility = (state: VisualBlockState) => {
-  state.titleVisible = !state.titleVisible
-}
+const onChangeTitleVisibility = (state: VisualBlockState) => {}
 
 const onChangePlane = (state: VisualBlockState, action: ActionType) => {
killedBy: ViewerBlock click tests show names click test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
simple-viewer/src/redux/visualBlockSlice.ts:36:24
 }
 
 const onChangeTitleVisibility = (state: VisualBlockState) => {
-  state.titleVisible = !state.titleVisible
+  state.titleVisible = state.titleVisible
 }
 
killedBy: ViewerBlock click tests show names click test
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
simple-viewer/src/redux/visualBlockSlice.ts:39:72
   state.titleVisible = !state.titleVisible
 }
 
-const onChangePlane = (state: VisualBlockState, action: ActionType) => {
-  state.plane = action.payload.plane
-}
+const onChangePlane = (state: VisualBlockState, action: ActionType) => {}
 
 export const visualBlockSlice = createSlice({
killedBy: viewerSlice states tests changePlane state test
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 0

  Object {
    "camPosition": "top",
    "meshStyle": "double",
