[Killed] BlockStatement
simple-viewer/src/saga/loadAttributeDataSaga.ts:15:3
 async function fetchAsyncParam<T, R>(
   func: (param: T) => Promise<{ ok: boolean; json: () => R }>,
   param: T
-) {
-  const response = await func(param)
-  if (response.ok) {
-    return response.json()
-  }
-  throw new Error("Unexpected error")
-}
+) {}
 
 function* fetchModelAttributes({ payload }: ActionType) {
killedBy: onLoadAttrStart->onLoadAttrSuccesscalled
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ConditionalExpression
simple-viewer/src/saga/loadAttributeDataSaga.ts:17:7
   param: T
 ) {
   const response = await func(param)
-  if (response.ok) {
+  if (false) {
     return response.json()
   }
killedBy: onLoadAttrStart->onLoadAttrSuccesscalled
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
simple-viewer/src/saga/loadAttributeDataSaga.ts:17:20
   param: T
 ) {
   const response = await func(param)
-  if (response.ok) {
-    return response.json()
-  }
+  if (response.ok) {}
   throw new Error("Unexpected error")
 }
killedBy: onLoadAttrStart->onLoadAttrSuccesscalled
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Survived] StringLiteral
simple-viewer/src/saga/loadAttributeDataSaga.ts:20:19
   if (response.ok) {
     return response.json()
   }
-  throw new Error("Unexpected error")
+  throw new Error("")
 }
 

[Killed] BlockStatement
simple-viewer/src/saga/loadAttributeDataSaga.ts:23:57
   throw new Error("Unexpected error")
 }
 
-function* fetchModelAttributes({ payload }: ActionType) {
-  try {
-    const attributes: ModelAttribute[] = payload.modelId
-      ? yield fetchAsyncParam<number, ModelAttribute[]>(
-          getModelAttributes,
-          payload.modelId
-        )
-      : undefined
-
-    yield put({
-      type: fetchAttributeDataFinished.type,
-      payload: { attributes: attributes },
-    })
-  } catch (e) {
-    yield put({ type: fetchAttributeDataFailed.type })
-  }
-}
+function* fetchModelAttributes({ payload }: ActionType) {}
 export default function* attributesLoadSaga() {
   yield takeEvery(fetchAttributeData, fetchModelAttributes)
killedBy: onLoadAttrStart->onLoadAttrSuccess failure called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
simple-viewer/src/saga/loadAttributeDataSaga.ts:24:7
 }
 
 function* fetchModelAttributes({ payload }: ActionType) {
-  try {
-    const attributes: ModelAttribute[] = payload.modelId
-      ? yield fetchAsyncParam<number, ModelAttribute[]>(
-          getModelAttributes,
-          payload.modelId
-        )
-      : undefined
-
-    yield put({
-      type: fetchAttributeDataFinished.type,
-      payload: { attributes: attributes },
-    })
-  } catch (e) {
+  try {} catch (e) {
     yield put({ type: fetchAttributeDataFailed.type })
   }
killedBy: onLoadAttrStart->onLoadAttrSuccess failure called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ObjectLiteral
simple-viewer/src/saga/loadAttributeDataSaga.ts:32:15
         )
       : undefined
 
-    yield put({
-      type: fetchAttributeDataFinished.type,
-      payload: { attributes: attributes },
-    })
+    yield put({})
   } catch (e) {
     yield put({ type: fetchAttributeDataFailed.type })
killedBy: onLoadAttrStart->onLoadAttrSuccess no modelId called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
simple-viewer/src/saga/loadAttributeDataSaga.ts:36:15
       type: fetchAttributeDataFinished.type,
       payload: { attributes: attributes },
     })
-  } catch (e) {
-    yield put({ type: fetchAttributeDataFailed.type })
-  }
+  } catch (e) {}
 }
 export default function* attributesLoadSaga() {
killedBy: onLoadAttrStart->onLoadAttrSuccess failure called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
simple-viewer/src/saga/loadAttributeDataSaga.ts:40:47
     yield put({ type: fetchAttributeDataFailed.type })
   }
 }
-export default function* attributesLoadSaga() {
-  yield takeEvery(fetchAttributeData, fetchModelAttributes)
-}
+export default function* attributesLoadSaga() {}
 
killedBy: onLoadAttrStart->onLoadAttrSuccess failure called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
