[Killed] BlockStatement
simple-viewer/src/saga/loadDataSaga.ts:11:3
 
 async function fetchAsync<T>(
   func: () => Promise<{ ok: boolean; json: () => T }>
-) {
-  const response = await func()
-  if (response.ok) {
-    return response.json()
-  }
-  throw new Error("Unexpected error")
-}
+) {}
 
 function* fetchModels() {
killedBy: onLoadStart->onLoadSuccess called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] ConditionalExpression
simple-viewer/src/saga/loadDataSaga.ts:13:7
   func: () => Promise<{ ok: boolean; json: () => T }>
 ) {
   const response = await func()
-  if (response.ok) {
+  if (false) {
     return response.json()
   }
killedBy: onLoadStart->onLoadSuccess called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
simple-viewer/src/saga/loadDataSaga.ts:13:20
   func: () => Promise<{ ok: boolean; json: () => T }>
 ) {
   const response = await func()
-  if (response.ok) {
-    return response.json()
-  }
+  if (response.ok) {}
   throw new Error("Unexpected error")
 }
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >

[Killed] BlockStatement
simple-viewer/src/saga/loadDataSaga.ts:19:25
   throw new Error("Unexpected error")
 }
 
-function* fetchModels() {
-  try {
-    const models: Model[] = yield fetchAsync<Model[]>(getModelTree)
-    setCenters(models)
-    yield put({
-      type: fetchFinished.type,
-      payload: { models: buildTree(models) },
-    })
-  } catch (e) {
-    yield put({ type: fetchFailure.type })
-  }
-}
+function* fetchModels() {}
 export default function* modelsLoadSaga() {
   yield takeEvery(fetchData, fetchModels)
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >

[Killed] BlockStatement
simple-viewer/src/saga/loadDataSaga.ts:20:7
 }
 
 function* fetchModels() {
-  try {
-    const models: Model[] = yield fetchAsync<Model[]>(getModelTree)
-    setCenters(models)
-    yield put({
-      type: fetchFinished.type,
-      payload: { models: buildTree(models) },
-    })
-  } catch (e) {
+  try {} catch (e) {
     yield put({ type: fetchFailure.type })
   }
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >

[Killed] ObjectLiteral
simple-viewer/src/saga/loadDataSaga.ts:23:15
   try {
     const models: Model[] = yield fetchAsync<Model[]>(getModelTree)
     setCenters(models)
-    yield put({
-      type: fetchFinished.type,
-      payload: { models: buildTree(models) },
-    })
+    yield put({})
   } catch (e) {
     yield put({ type: fetchFailure.type })
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >

[Killed] ObjectLiteral
simple-viewer/src/saga/loadDataSaga.ts:25:16
     setCenters(models)
     yield put({
       type: fetchFinished.type,
-      payload: { models: buildTree(models) },
+      payload: {},
     })
   } catch (e) {
killedBy: App render tests render APP test
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
simple-viewer/src/saga/loadDataSaga.ts:27:15
       type: fetchFinished.type,
       payload: { models: buildTree(models) },
     })
-  } catch (e) {
-    yield put({ type: fetchFailure.type })
-  }
+  } catch (e) {}
 }
 export default function* modelsLoadSaga() {
killedBy: onLoadStart->onLoadSuccess failure called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
simple-viewer/src/saga/loadDataSaga.ts:31:43
     yield put({ type: fetchFailure.type })
   }
 }
-export default function* modelsLoadSaga() {
-  yield takeEvery(fetchData, fetchModels)
-}
+export default function* modelsLoadSaga() {}
 
killedBy: onLoadStart->onLoadSuccess called
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
