[Survived] BlockStatement
src/threejs/materials/CircleMaterial.tsx:32:50
       `,
 }
 
-const getUniformsForCircles = (color: string) => {
-  return Object.assign(
-    THREE.UniformsUtils.merge([
-      THREE.UniformsLib.common,
-      THREE.UniformsLib.fog,
-      THREE.UniformsLib.points,
-    ]),
-    {
-      size: {
-        value: 5,
-      },
-    },
-    {
-      outherColor: {
-        value: new THREE.Color("black"),
-      },
-    },
-    {
-      innerColor: {
-        value: new THREE.Color(color),
-      },
-    }
-  )
-}
+const getUniformsForCircles = (color: string) => {}
 
 type CircleMaterialProps = {

[Survived] ObjectLiteral
src/threejs/materials/CircleMaterial.tsx:39:5
       THREE.UniformsLib.fog,
       THREE.UniformsLib.points,
     ]),
-    {
-      size: {
-        value: 5,
-      },
-    },
+    {},
     {
       outherColor: {

[Survived] ObjectLiteral
src/threejs/materials/CircleMaterial.tsx:45:20
       },
     },
     {
-      outherColor: {
-        value: new THREE.Color("black"),
-      },
+      outherColor: {},
     },
     {

[Killed] ArrowFunction
src/threejs/materials/CircleMaterial.tsx:61:31
   color: string
 }
 
-export const CircleMaterial = ({ color }: CircleMaterialProps) => (
-  <shaderMaterial
-    type={"CirclePointMaterial"}
-    uniforms={getUniformsForCircles(color)}
-    vertexShader={THREE.ShaderLib["circlePointMaterial"].vertexShader}
-    fragmentShader={THREE.ShaderLib["circlePointMaterial"].fragmentShader}
-    clipping={true}
-  />
-)
+export const CircleMaterial = () => undefined
 
killedBy: mesh circle material
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] StringLiteral
src/threejs/materials/CircleMaterial.tsx:65:35
   <shaderMaterial
     type={"CirclePointMaterial"}
     uniforms={getUniformsForCircles(color)}
-    vertexShader={THREE.ShaderLib["circlePointMaterial"].vertexShader}
+    vertexShader={THREE.ShaderLib[""].vertexShader}
     fragmentShader={THREE.ShaderLib["circlePointMaterial"].fragmentShader}
     clipping={true}
killedBy: mesh circle material
statusReason: TypeError: Cannot read properties of undefined (reading 'vertexShader')

[Killed] BooleanLiteral
src/threejs/materials/CircleMaterial.tsx:67:15
     uniforms={getUniformsForCircles(color)}
     vertexShader={THREE.ShaderLib["circlePointMaterial"].vertexShader}
     fragmentShader={THREE.ShaderLib["circlePointMaterial"].fragmentShader}
-    clipping={true}
+    clipping={false}
   />
 )
killedBy: Render circles, check props
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
