[Killed] BlockStatement
src/threejs/sections/Section.tsx:7:55
   section: number[][]
 }
 
-export const Section = ({ section }: SectionProps) => {
-  return (
-    <Fragment>
-      {section.map((line, index) => (
-        <Line key={index} points={line} color="darkgreen" />
-      ))}
-    </Fragment>
-  )
-}
+export const Section = ({ section }: SectionProps) => {}
 
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')

[Killed] ArrowFunction
src/threejs/sections/Section.tsx:10:20
 export const Section = ({ section }: SectionProps) => {
   return (
     <Fragment>
-      {section.map((line, index) => (
-        <Line key={index} points={line} color="darkgreen" />
-      ))}
+      {section.map(() => undefined)}
     </Fragment>
   )
killedBy: Viewer render test
statusReason: TypeError: Cannot read properties of undefined (reading 'props')
