[Survived] BlockStatement
src/threejs/viewer/Viewer.tsx:20:38
   const viewState = useSelector<AppStateType, VisualBlockState>(
     visualBlockDataState
   )
-  const sectionPlane = useMemo(() => {
-    if (
-      !viewState.plane ||
-      !viewState.plane.normal ||
-      !viewState.plane.vectorLength ||
-      !viewState.plane.sectionsVisible
-    ) {
-      return null
-    }
-    const plane = new THREE.Plane()
-    plane.constant = viewState.plane.vectorLength
-
-    plane.normal = new THREE.Vector3(...viewState.plane.normal)
-
-    return plane
-  }, [viewState.plane])
+  const sectionPlane = useMemo(() => {}, [viewState.plane])
   return (
     <Canvas

[Killed] LogicalOperator
src/threejs/viewer/Viewer.tsx:22:7
   )
   const sectionPlane = useMemo(() => {
     if (
-      !viewState.plane ||
-      !viewState.plane.normal ||
+      !viewState.plane && !viewState.plane.normal ||
       !viewState.plane.vectorLength ||
       !viewState.plane.sectionsVisible
killedBy: ViewerBlock render tests render empty ViewerBlock test
statusReason: TypeError: Cannot read properties of undefined (reading 'normal')

[Killed] LogicalOperator
src/threejs/viewer/Viewer.tsx:22:7
   )
   const sectionPlane = useMemo(() => {
     if (
-      !viewState.plane ||
-      !viewState.plane.normal ||
-      !viewState.plane.vectorLength ||
+      (!viewState.plane || !viewState.plane.normal) && !viewState.plane.vectorLength ||
       !viewState.plane.sectionsVisible
     ) {
killedBy: ViewerBlock render tests render empty ViewerBlock test
statusReason: TypeError: Cannot read properties of undefined (reading 'vectorLength')

[Survived] BooleanLiteral
src/threejs/viewer/Viewer.tsx:23:7
   const sectionPlane = useMemo(() => {
     if (
       !viewState.plane ||
-      !viewState.plane.normal ||
+      viewState.plane.normal ||
       !viewState.plane.vectorLength ||
       !viewState.plane.sectionsVisible

[Survived] BooleanLiteral
src/threejs/viewer/Viewer.tsx:24:7
     if (
       !viewState.plane ||
       !viewState.plane.normal ||
-      !viewState.plane.vectorLength ||
+      viewState.plane.vectorLength ||
       !viewState.plane.sectionsVisible
     ) {

[Survived] BooleanLiteral
src/threejs/viewer/Viewer.tsx:25:7
       !viewState.plane ||
       !viewState.plane.normal ||
       !viewState.plane.vectorLength ||
-      !viewState.plane.sectionsVisible
+      viewState.plane.sectionsVisible
     ) {
       return null

[Killed] BlockStatement
src/threejs/viewer/Viewer.tsx:26:7
       !viewState.plane.normal ||
       !viewState.plane.vectorLength ||
       !viewState.plane.sectionsVisible
-    ) {
-      return null
-    }
+    ) {}
     const plane = new THREE.Plane()
     plane.constant = viewState.plane.vectorLength
killedBy: ViewerBlock render tests render empty ViewerBlock test
statusReason: TypeError: Cannot read properties of undefined (reading 'vectorLength')

[Survived] StringLiteral
src/threejs/viewer/Viewer.tsx:39:17
   return (
     <Canvas
       style={{
-        height: "880px",
+        height: "",
         width: "100%",
         background: "white",

[Survived] StringLiteral
src/threejs/viewer/Viewer.tsx:40:16
     <Canvas
       style={{
         height: "880px",
-        width: "100%",
+        width: "",
         background: "white",
       }}

[Survived] UnaryOperator
src/threejs/viewer/Viewer.tsx:46:15
     >
       <OrthographicCamera
         makeDefault
-        left={-1}
+        left={+1}
         right={1}
         top={1}

[Survived] UnaryOperator
src/threejs/viewer/Viewer.tsx:49:17
         left={-1}
         right={1}
         top={1}
-        bottom={-1}
+        bottom={+1}
         near={0.1}
         far={10000}

[Survived] ArrayDeclaration
src/threejs/viewer/Viewer.tsx:64:25
       </Provider>
       <hemisphereLight />
       <OrbitControls />
-      <gridHelper args={[150, 15, "black", "black"]} />
+      <gridHelper args={[]} />
       <axesHelper args={[75]} />
     </Canvas>
