[Killed] BlockStatement
simple-viewer/src/utils/CheckboxPropagation.ts:15:6
   checks: number[],
   index: number | undefined,
   state: number | undefined
-) => {
-  if (
-    (index || index === 0) &&
-    index >= 0 &&
-    index < tree.length &&
-    (state === 0 || state === 1)
-  ) {
-    const checksCopy = [...checks]
-    const model = tree[index]
-    checksCopy[index] = state
-    //propagate up - to parents
-    propagateUp(tree, checksCopy, index, state, model)
-    if (!isLeaf(tree, index, getCurrentPath(model))) {
-      propagateDown(tree, checksCopy, index, state)
-    }
-    return checksCopy
-  }
-  return checks
-}
+) => {}
 
 const propagateDown = (
killedBy: click tests checkbox test
statusReason: TypeError: Cannot read properties of undefined (reading '3')

[Killed] LogicalOperator
simple-viewer/src/utils/CheckboxPropagation.ts:17:5
   state: number | undefined
 ) => {
   if (
-    (index || index === 0) &&
-    index >= 0 &&
-    index < tree.length &&
+    (index || index === 0) && index >= 0 || index < tree.length &&
     (state === 0 || state === 1)
   ) {
killedBy: wrong input tests wrong index
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:17:15
   state: number | undefined
 ) => {
   if (
-    (index || index === 0) &&
+    (index || false) &&
     index >= 0 &&
     index < tree.length &&
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   0,
-   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:18:5
 ) => {
   if (
     (index || index === 0) &&
-    index >= 0 &&
+    true &&
     index < tree.length &&
     (state === 0 || state === 1)
killedBy: wrong input tests negative index
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] EqualityOperator
simple-viewer/src/utils/CheckboxPropagation.ts:18:5
 ) => {
   if (
     (index || index === 0) &&
-    index >= 0 &&
+    index > 0 &&
     index < tree.length &&
     (state === 0 || state === 1)
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   0,
-   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:19:5
   if (
     (index || index === 0) &&
     index >= 0 &&
-    index < tree.length &&
+    true &&
     (state === 0 || state === 1)
   ) {
killedBy: wrong input tests wrong index
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] EqualityOperator
simple-viewer/src/utils/CheckboxPropagation.ts:19:5
   if (
     (index || index === 0) &&
     index >= 0 &&
-    index < tree.length &&
+    index <= tree.length &&
     (state === 0 || state === 1)
   ) {
killedBy: wrong input tests wrong index
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] EqualityOperator
simple-viewer/src/utils/CheckboxPropagation.ts:20:21
     (index || index === 0) &&
     index >= 0 &&
     index < tree.length &&
-    (state === 0 || state === 1)
+    (state === 0 || state !== 1)
   ) {
     const checksCopy = [...checks]
killedBy: propagation check tests up check
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   1,
-   1,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:20:6
     (index || index === 0) &&
     index >= 0 &&
     index < tree.length &&
-    (state === 0 || state === 1)
+    (false || state === 1)
   ) {
     const checksCopy = [...checks]
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] BlockStatement
simple-viewer/src/utils/CheckboxPropagation.ts:21:5
     index >= 0 &&
     index < tree.length &&
     (state === 0 || state === 1)
-  ) {
-    const checksCopy = [...checks]
-    const model = tree[index]
-    checksCopy[index] = state
-    //propagate up - to parents
-    propagateUp(tree, checksCopy, index, state, model)
-    if (!isLeaf(tree, index, getCurrentPath(model))) {
-      propagateDown(tree, checksCopy, index, state)
-    }
-    return checksCopy
-  }
+  ) {}
   return checks
 }
killedBy: click tests checkbox test
statusReason: Error: expect(received).not.toStrictEqual(expected) // deep equality

Expected: not [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, …]

[Killed] BlockStatement
simple-viewer/src/utils/CheckboxPropagation.ts:27:54
     checksCopy[index] = state
     //propagate up - to parents
     propagateUp(tree, checksCopy, index, state, model)
-    if (!isLeaf(tree, index, getCurrentPath(model))) {
-      propagateDown(tree, checksCopy, index, state)
-    }
+    if (!isLeaf(tree, index, getCurrentPath(model))) {}
     return checksCopy
   }
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    0,
-   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:27:9
     checksCopy[index] = state
     //propagate up - to parents
     propagateUp(tree, checksCopy, index, state, model)
-    if (!isLeaf(tree, index, getCurrentPath(model))) {
+    if (false) {
       propagateDown(tree, checksCopy, index, state)
     }
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    0,
-   0,

[Killed] BlockStatement
simple-viewer/src/utils/CheckboxPropagation.ts:40:6
   checksCopy: number[],
   index: number,
   state: number
-) => {
-  const childrenIndexes = getAllChildrenIndexes(index, tree)
-  //set same value to all children
-  childrenIndexes.forEach((i) => {
-    checksCopy[i] = state
-  })
-}
+) => {}
 
 const propagateUp = (
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    0,
-   0,

[Killed] BlockStatement
simple-viewer/src/utils/CheckboxPropagation.ts:43:34
 ) => {
   const childrenIndexes = getAllChildrenIndexes(index, tree)
   //set same value to all children
-  childrenIndexes.forEach((i) => {
-    checksCopy[i] = state
-  })
+  childrenIndexes.forEach((i) => {})
 }
 
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    0,
-   0,

[Killed] BlockStatement
simple-viewer/src/utils/CheckboxPropagation.ts:54:6
   index: number,
   state: number,
   model: Model
-) => {
-  const parents = getAllParentIndexes(model, index, tree)
-  parents.forEach((i) => {
-    const childrenIndexes = getChildrenIndexes(i, tree)
-    const checkedCount = childrenIndexes.filter(
-      (x) => checksCopy[x] === 1
-    ).length
-    //change to 0 or 2
-    if (state === 0) {
-      checksCopy[i] = checkedCount === 0 ? 0 : 2
-    } else {
-      //change to 1 or 2
-      checksCopy[i] = checkedCount === childrenIndexes.length ? 1 : 2
-    }
-  })
-}
+) => {}
 
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] BlockStatement
simple-viewer/src/utils/CheckboxPropagation.ts:56:26
   model: Model
 ) => {
   const parents = getAllParentIndexes(model, index, tree)
-  parents.forEach((i) => {
-    const childrenIndexes = getChildrenIndexes(i, tree)
-    const checkedCount = childrenIndexes.filter(
-      (x) => checksCopy[x] === 1
-    ).length
-    //change to 0 or 2
-    if (state === 0) {
-      checksCopy[i] = checkedCount === 0 ? 0 : 2
-    } else {
-      //change to 1 or 2
-      checksCopy[i] = checkedCount === childrenIndexes.length ? 1 : 2
-    }
-  })
+  parents.forEach((i) => {})
 }
 
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] MethodExpression
simple-viewer/src/utils/CheckboxPropagation.ts:58:26
   const parents = getAllParentIndexes(model, index, tree)
   parents.forEach((i) => {
     const childrenIndexes = getChildrenIndexes(i, tree)
-    const checkedCount = childrenIndexes.filter(
-      (x) => checksCopy[x] === 1
-    ).length
+    const checkedCount = childrenIndexes.length
     //change to 0 or 2
     if (state === 0) {
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] ArrowFunction
simple-viewer/src/utils/CheckboxPropagation.ts:59:7
   parents.forEach((i) => {
     const childrenIndexes = getChildrenIndexes(i, tree)
     const checkedCount = childrenIndexes.filter(
-      (x) => checksCopy[x] === 1
+      () => undefined
     ).length
     //change to 0 or 2
killedBy: propagation check tests up check
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   1,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:59:14
   parents.forEach((i) => {
     const childrenIndexes = getChildrenIndexes(i, tree)
     const checkedCount = childrenIndexes.filter(
-      (x) => checksCopy[x] === 1
+      (x) => false
     ).length
     //change to 0 or 2
killedBy: propagation check tests up check
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   1,

[Killed] EqualityOperator
simple-viewer/src/utils/CheckboxPropagation.ts:62:9
       (x) => checksCopy[x] === 1
     ).length
     //change to 0 or 2
-    if (state === 0) {
+    if (state !== 0) {
       checksCopy[i] = checkedCount === 0 ? 0 : 2
     } else {
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:62:9
       (x) => checksCopy[x] === 1
     ).length
     //change to 0 or 2
-    if (state === 0) {
+    if (false) {
       checksCopy[i] = checkedCount === 0 ? 0 : 2
     } else {
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] EqualityOperator
simple-viewer/src/utils/CheckboxPropagation.ts:63:23
     ).length
     //change to 0 or 2
     if (state === 0) {
-      checksCopy[i] = checkedCount === 0 ? 0 : 2
+      checksCopy[i] = checkedCount !== 0 ? 0 : 2
     } else {
       //change to 1 or 2
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:63:23
     ).length
     //change to 0 or 2
     if (state === 0) {
-      checksCopy[i] = checkedCount === 0 ? 0 : 2
+      checksCopy[i] = false ? 0 : 2
     } else {
       //change to 1 or 2
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] BlockStatement
simple-viewer/src/utils/CheckboxPropagation.ts:64:12
     //change to 0 or 2
     if (state === 0) {
       checksCopy[i] = checkedCount === 0 ? 0 : 2
-    } else {
-      //change to 1 or 2
-      checksCopy[i] = checkedCount === childrenIndexes.length ? 1 : 2
-    }
+    } else {}
   })
 }
killedBy: propagation check tests up check
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   1,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:66:23
       checksCopy[i] = checkedCount === 0 ? 0 : 2
     } else {
       //change to 1 or 2
-      checksCopy[i] = checkedCount === childrenIndexes.length ? 1 : 2
+      checksCopy[i] = true ? 1 : 2
     }
   })
killedBy: propagation halfcheck tests up uncheck -> halfcheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   1,

[Killed] ConditionalExpression
simple-viewer/src/utils/CheckboxPropagation.ts:66:23
       checksCopy[i] = checkedCount === 0 ? 0 : 2
     } else {
       //change to 1 or 2
-      checksCopy[i] = checkedCount === childrenIndexes.length ? 1 : 2
+      checksCopy[i] = false ? 1 : 2
     }
   })
killedBy: propagation check tests up check
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   1,
