[Killed] BlockStatement
simple-viewer/src/utils/FillCenterHelper.ts:3:48
 import { Model } from "../dto/Model"
 
-export const setCenters = (models: Model[]) => {
-  models.forEach((model) => {
-    if (model.triangulation && model.triangulation.length > 0) {
-      model.center = getCenter(model.triangulation)
-    }
-  })
-}
+export const setCenters = (models: Model[]) => {}
 
 const getCenter = (triangulation: number[]) => {
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [1, 1, 0]
Received: undefined

[Killed] BlockStatement
simple-viewer/src/utils/FillCenterHelper.ts:4:29
 import { Model } from "../dto/Model"
 
 export const setCenters = (models: Model[]) => {
-  models.forEach((model) => {
-    if (model.triangulation && model.triangulation.length > 0) {
-      model.center = getCenter(model.triangulation)
-    }
-  })
+  models.forEach((model) => {})
 }
 
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [1, 1, 0]
Received: undefined

[Killed] LogicalOperator
simple-viewer/src/utils/FillCenterHelper.ts:5:9
 
 export const setCenters = (models: Model[]) => {
   models.forEach((model) => {
-    if (model.triangulation && model.triangulation.length > 0) {
+    if (model.triangulation || model.triangulation.length > 0) {
       model.center = getCenter(model.triangulation)
     }
killedBy: getCenter tests empty tr check
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
simple-viewer/src/utils/FillCenterHelper.ts:5:9
 
 export const setCenters = (models: Model[]) => {
   models.forEach((model) => {
-    if (model.triangulation && model.triangulation.length > 0) {
+    if (true) {
       model.center = getCenter(model.triangulation)
     }
killedBy: getCenter tests empty tr check
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
simple-viewer/src/utils/FillCenterHelper.ts:11:48
   })
 }
 
-const getCenter = (triangulation: number[]) => {
-  let sx = 0
-  let sy = 0
-  let sz = 0
-  for (let index = 0; index < triangulation.length; index += 3) {
-    sx = sx + triangulation[index]
-    sy = sy + triangulation[index + 1]
-    sz = sz + triangulation[index + 2]
-  }
-  const n = triangulation.length / 3
-  return [sx / n, sy / n, sz / n]
-}
+const getCenter = (triangulation: number[]) => {}
 
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [1, 1, 0]
Received: undefined

[Killed] EqualityOperator
simple-viewer/src/utils/FillCenterHelper.ts:15:23
   let sx = 0
   let sy = 0
   let sz = 0
-  for (let index = 0; index < triangulation.length; index += 3) {
+  for (let index = 0; index >= triangulation.length; index += 3) {
     sx = sx + triangulation[index]
     sy = sy + triangulation[index + 1]
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   1,

[Killed] ConditionalExpression
simple-viewer/src/utils/FillCenterHelper.ts:15:23
   let sx = 0
   let sy = 0
   let sz = 0
-  for (let index = 0; index < triangulation.length; index += 3) {
+  for (let index = 0; false; index += 3) {
     sx = sx + triangulation[index]
     sy = sy + triangulation[index + 1]
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   1,

[Killed] ArithmeticOperator
simple-viewer/src/utils/FillCenterHelper.ts:16:10
   let sy = 0
   let sz = 0
   for (let index = 0; index < triangulation.length; index += 3) {
-    sx = sx + triangulation[index]
+    sx = sx - triangulation[index]
     sy = sy + triangulation[index + 1]
     sz = sz + triangulation[index + 2]
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   -1,

[Killed] ArithmeticOperator
simple-viewer/src/utils/FillCenterHelper.ts:17:29
   let sz = 0
   for (let index = 0; index < triangulation.length; index += 3) {
     sx = sx + triangulation[index]
-    sy = sy + triangulation[index + 1]
+    sy = sy + triangulation[index - 1]
     sz = sz + triangulation[index + 2]
   }
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   1,

[Killed] ArithmeticOperator
simple-viewer/src/utils/FillCenterHelper.ts:17:10
   let sz = 0
   for (let index = 0; index < triangulation.length; index += 3) {
     sx = sx + triangulation[index]
-    sy = sy + triangulation[index + 1]
+    sy = sy - triangulation[index + 1]
     sz = sz + triangulation[index + 2]
   }
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   1,

[Killed] ArithmeticOperator
simple-viewer/src/utils/FillCenterHelper.ts:18:29
   for (let index = 0; index < triangulation.length; index += 3) {
     sx = sx + triangulation[index]
     sy = sy + triangulation[index + 1]
-    sz = sz + triangulation[index + 2]
+    sz = sz + triangulation[index - 2]
   }
   const n = triangulation.length / 3
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
    1,

[Killed] ArithmeticOperator
simple-viewer/src/utils/FillCenterHelper.ts:18:10
   for (let index = 0; index < triangulation.length; index += 3) {
     sx = sx + triangulation[index]
     sy = sy + triangulation[index + 1]
-    sz = sz + triangulation[index + 2]
+    sz = sz - triangulation[index + 2]
   }
   const n = triangulation.length / 3
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
    0,

[Killed] ArithmeticOperator
simple-viewer/src/utils/FillCenterHelper.ts:20:13
     sy = sy + triangulation[index + 1]
     sz = sz + triangulation[index + 2]
   }
-  const n = triangulation.length / 3
+  const n = triangulation.length * 3
   return [sx / n, sy / n, sz / n]
 }
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
-   1,

[Killed] ArithmeticOperator
simple-viewer/src/utils/FillCenterHelper.ts:21:19
     sz = sz + triangulation[index + 2]
   }
   const n = triangulation.length / 3
-  return [sx / n, sy / n, sz / n]
+  return [sx / n, sy * n, sz / n]
 }
 
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    1,
-   1,

[Killed] ArithmeticOperator
simple-viewer/src/utils/FillCenterHelper.ts:21:11
     sz = sz + triangulation[index + 2]
   }
   const n = triangulation.length / 3
-  return [sx / n, sy / n, sz / n]
+  return [sx * n, sy / n, sz / n]
 }
 
killedBy: getCenter tests sqr center
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   1,
+   36,
