[Killed] ArrowFunction
simple-viewer/src/utils/TreePathHelper.ts:3:23
 import { Model } from "../dto/Model"
 
-export const isLeaf = (models: Model[], index: number, currentPath: string) =>
-  index >= 0 &&
-  (index + 1 === models.length ||
-    (index + 1 < models.length &&
-      !models[index + 1].path.startsWith(currentPath)))
+export const isLeaf = () => undefined
 
 export const getCurrentPath = (currentModel: Model) =>
killedBy: isLeaf tests is leaf
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] LogicalOperator
simple-viewer/src/utils/TreePathHelper.ts:4:3
 import { Model } from "../dto/Model"
 
 export const isLeaf = (models: Model[], index: number, currentPath: string) =>
-  index >= 0 &&
-  (index + 1 === models.length ||
-    (index + 1 < models.length &&
-      !models[index + 1].path.startsWith(currentPath)))
+  index >= 0 || index + 1 === models.length || index + 1 < models.length && !models[index + 1].path.startsWith(currentPath)
 
 export const getCurrentPath = (currentModel: Model) =>
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    0,
-   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/TreePathHelper.ts:4:3
 import { Model } from "../dto/Model"
 
 export const isLeaf = (models: Model[], index: number, currentPath: string) =>
-  index >= 0 &&
-  (index + 1 === models.length ||
-    (index + 1 < models.length &&
-      !models[index + 1].path.startsWith(currentPath)))
+  false
 
 export const getCurrentPath = (currentModel: Model) =>
killedBy: ModelTree render tests render ModelTree test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeLeaf"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <ul
      class="ul"
      data-testid="modelTree"

[Killed] EqualityOperator
simple-viewer/src/utils/TreePathHelper.ts:5:4
 
 export const isLeaf = (models: Model[], index: number, currentPath: string) =>
   index >= 0 &&
-  (index + 1 === models.length ||
+  (index + 1 !== models.length ||
     (index + 1 < models.length &&
       !models[index + 1].path.startsWith(currentPath)))
killedBy: isLeaf tests last is leaf
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
simple-viewer/src/utils/TreePathHelper.ts:5:4
 
 export const isLeaf = (models: Model[], index: number, currentPath: string) =>
   index >= 0 &&
-  (index + 1 === models.length ||
+  (false ||
     (index + 1 < models.length &&
       !models[index + 1].path.startsWith(currentPath)))
killedBy: ModelTree render tests render short tree test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 2

[Killed] EqualityOperator
simple-viewer/src/utils/TreePathHelper.ts:6:6
 export const isLeaf = (models: Model[], index: number, currentPath: string) =>
   index >= 0 &&
   (index + 1 === models.length ||
-    (index + 1 < models.length &&
+    (index + 1 >= models.length &&
       !models[index + 1].path.startsWith(currentPath)))
 
killedBy: ModelTree render tests render short tree test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 1

[Killed] LogicalOperator
simple-viewer/src/utils/TreePathHelper.ts:6:6
 export const isLeaf = (models: Model[], index: number, currentPath: string) =>
   index >= 0 &&
   (index + 1 === models.length ||
-    (index + 1 < models.length &&
-      !models[index + 1].path.startsWith(currentPath)))
+    (index + 1 < models.length || !models[index + 1].path.startsWith(currentPath)))
 
 export const getCurrentPath = (currentModel: Model) =>
killedBy: ModelTree render tests render short tree test
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 7

[Killed] BooleanLiteral
simple-viewer/src/utils/TreePathHelper.ts:7:7
   index >= 0 &&
   (index + 1 === models.length ||
     (index + 1 < models.length &&
-      !models[index + 1].path.startsWith(currentPath)))
+      models[index + 1].path.startsWith(currentPath)))
 
 export const getCurrentPath = (currentModel: Model) =>
killedBy: Buttons click tests collapse/expand all click
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="treeParentCont1000"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="block"
      data-testid="modelBlock"

[Killed] ArithmeticOperator
simple-viewer/src/utils/TreePathHelper.ts:7:15
   index >= 0 &&
   (index + 1 === models.length ||
     (index + 1 < models.length &&
-      !models[index + 1].path.startsWith(currentPath)))
+      !models[index - 1].path.startsWith(currentPath)))
 
 export const getCurrentPath = (currentModel: Model) =>
killedBy: App render tests render APP test
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] ArrowFunction
simple-viewer/src/utils/TreePathHelper.ts:9:31
     (index + 1 < models.length &&
       !models[index + 1].path.startsWith(currentPath)))
 
-export const getCurrentPath = (currentModel: Model) =>
-  currentModel.path
-    ? currentModel.path + "/" + currentModel.name
-    : currentModel.name
+export const getCurrentPath = () => undefined
 
 export const getAllParentIndexes = (
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] BlockStatement
simple-viewer/src/utils/TreePathHelper.ts:18:6
   currentModel: Model,
   index: number,
   tree: Model[]
-) => {
-  const parents: number[] = []
-  let currentPath = currentModel.path
-  for (let i = index - 1; i >= 0; i--) {
-    const node = tree[i]
-    const nodePath = getCurrentPath(node)
-    if (nodePath === currentPath) {
-      parents.push(i)
-      currentPath = node.path
-    }
-  }
-  return parents
-}
+) => {}
 
 export const getChildrenIndexes = (index: number, tree: Model[]) => {
killedBy: getAllParentIndexes tests from leaf
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [1, 0]
Received: undefined

[Killed] UpdateOperator
simple-viewer/src/utils/TreePathHelper.ts:21:35
 ) => {
   const parents: number[] = []
   let currentPath = currentModel.path
-  for (let i = index - 1; i >= 0; i--) {
+  for (let i = index - 1; i >= 0; i++) {
     const node = tree[i]
     const nodePath = getCurrentPath(node)
killedBy: click tests checkbox test
statusReason: TypeError: Cannot read properties of undefined (reading 'path')

[Killed] ConditionalExpression
simple-viewer/src/utils/TreePathHelper.ts:21:27
 ) => {
   const parents: number[] = []
   let currentPath = currentModel.path
-  for (let i = index - 1; i >= 0; i--) {
+  for (let i = index - 1; false; i--) {
     const node = tree[i]
     const nodePath = getCurrentPath(node)
killedBy: getAllParentIndexes tests from leaf
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   1,
-   0,

[Killed] BlockStatement
simple-viewer/src/utils/TreePathHelper.ts:24:35
   for (let i = index - 1; i >= 0; i--) {
     const node = tree[i]
     const nodePath = getCurrentPath(node)
-    if (nodePath === currentPath) {
-      parents.push(i)
-      currentPath = node.path
-    }
+    if (nodePath === currentPath) {}
   }
   return parents
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/TreePathHelper.ts:24:9
   for (let i = index - 1; i >= 0; i--) {
     const node = tree[i]
     const nodePath = getCurrentPath(node)
-    if (nodePath === currentPath) {
+    if (true) {
       parents.push(i)
       currentPath = node.path
killedBy: getAllParentIndexes tests from middle
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
+   2,
+   1,

[Killed] BlockStatement
simple-viewer/src/utils/TreePathHelper.ts:32:69
   return parents
 }
 
-export const getChildrenIndexes = (index: number, tree: Model[]) => {
-  const currentModel = tree[index]
-  const parentPath = getCurrentPath(currentModel)
-  const indexes: number[] = []
-
-  for (let i = index + 1; i < tree.length; i++) {
-    const node = tree[i]
-    if (parentPath === node.path) {
-      indexes.push(i)
-    } else if (!node.path.startsWith(parentPath)) {
-      return indexes
-    }
-  }
-  return indexes
-}
+export const getChildrenIndexes = (index: number, tree: Model[]) => {}
 
 export const getAllChildrenIndexes = (index: number, tree: Model[]) => {
killedBy: click tests checkbox test
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ArrayDeclaration
simple-viewer/src/utils/TreePathHelper.ts:35:29
 export const getChildrenIndexes = (index: number, tree: Model[]) => {
   const currentModel = tree[index]
   const parentPath = getCurrentPath(currentModel)
-  const indexes: number[] = []
+  const indexes: number[] = ["Stryker was here"]
 
   for (let i = index + 1; i < tree.length; i++) {
killedBy: getChildrenIndexes tests from leaf
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ArithmeticOperator
simple-viewer/src/utils/TreePathHelper.ts:37:16
   const parentPath = getCurrentPath(currentModel)
   const indexes: number[] = []
 
-  for (let i = index + 1; i < tree.length; i++) {
+  for (let i = index - 1; i < tree.length; i++) {
     const node = tree[i]
     if (parentPath === node.path) {
killedBy: getChildrenIndexes tests from middle
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   2,
- ]

[Killed] EqualityOperator
simple-viewer/src/utils/TreePathHelper.ts:37:27
   const parentPath = getCurrentPath(currentModel)
   const indexes: number[] = []
 
-  for (let i = index + 1; i < tree.length; i++) {
+  for (let i = index + 1; i >= tree.length; i++) {
     const node = tree[i]
     if (parentPath === node.path) {
killedBy: propagation halfcheck tests up check -> halfcheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   0,

[Killed] EqualityOperator
simple-viewer/src/utils/TreePathHelper.ts:39:9
 
   for (let i = index + 1; i < tree.length; i++) {
     const node = tree[i]
-    if (parentPath === node.path) {
+    if (parentPath !== node.path) {
       indexes.push(i)
     } else if (!node.path.startsWith(parentPath)) {
killedBy: propagation uncheck tests up uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   0,
-   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/TreePathHelper.ts:39:9
 
   for (let i = index + 1; i < tree.length; i++) {
     const node = tree[i]
-    if (parentPath === node.path) {
+    if (true) {
       indexes.push(i)
     } else if (!node.path.startsWith(parentPath)) {
killedBy: getChildrenIndexes tests from leaf
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 4

- Array []
+ Array [
+   3,

[Killed] MethodExpression
simple-viewer/src/utils/TreePathHelper.ts:41:17
     const node = tree[i]
     if (parentPath === node.path) {
       indexes.push(i)
-    } else if (!node.path.startsWith(parentPath)) {
+    } else if (!node.path.endsWith(parentPath)) {
       return indexes
     }
killedBy: propagation halfcheck tests up check -> halfcheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   2,
+   0,

[Killed] ConditionalExpression
simple-viewer/src/utils/TreePathHelper.ts:41:16
     const node = tree[i]
     if (parentPath === node.path) {
       indexes.push(i)
-    } else if (!node.path.startsWith(parentPath)) {
+    } else if (true) {
       return indexes
     }
killedBy: getChildrenIndexes tests from root
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

  Array [
    1,
-   3,

[Killed] BlockStatement
simple-viewer/src/utils/TreePathHelper.ts:48:72
   return indexes
 }
 
-export const getAllChildrenIndexes = (index: number, tree: Model[]) => {
-  const currentModel = tree[index]
-  const parentPath = getCurrentPath(currentModel)
-  const indexes: number[] = []
-
-  for (let i = index + 1; i < tree.length; i++) {
-    const node = tree[i]
-    if (node.path.startsWith(parentPath)) {
-      indexes.push(i)
-    } else {
-      return indexes
-    }
-  }
-  return indexes
-}
+export const getAllChildrenIndexes = (index: number, tree: Model[]) => {}
 
killedBy: getAllChildrenIndexes tests from leaf
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] MethodExpression
simple-viewer/src/utils/TreePathHelper.ts:55:9
 
   for (let i = index + 1; i < tree.length; i++) {
     const node = tree[i]
-    if (node.path.startsWith(parentPath)) {
+    if (node.path.endsWith(parentPath)) {
       indexes.push(i)
     } else {
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
    0,

[Killed] ConditionalExpression
simple-viewer/src/utils/TreePathHelper.ts:55:9
 
   for (let i = index + 1; i < tree.length; i++) {
     const node = tree[i]
-    if (node.path.startsWith(parentPath)) {
+    if (true) {
       indexes.push(i)
     } else {
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    0,
    0,

[Killed] BlockStatement
simple-viewer/src/utils/TreePathHelper.ts:57:12
     const node = tree[i]
     if (node.path.startsWith(parentPath)) {
       indexes.push(i)
-    } else {
-      return indexes
-    }
+    } else {}
   }
   return indexes
killedBy: propagation uncheck tests down uncheck
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    0,
    0,
