[Killed] ConditionalExpression
simple-viewer/src/utils/TreeTransform.ts:7:49
   const treePaths = models.flatMap((x) => {
     const path = getNormalPath(x)
     const pathArray =
-      path.indexOf("/") > 0 ? path.split("/") : path.length > 0 ? [path] : []
+      path.indexOf("/") > 0 ? path.split("/") : false ? [path] : []
     const transformed: string[] = pathArray.map((pathElem, index) =>
       getPath(pathArray, index + 1)
killedBy: incorrect trees tests wrong two node tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 0

  Array [
    Object {
-     "id": 1000,

[Killed] EqualityOperator
simple-viewer/src/utils/TreeTransform.ts:7:49
   const treePaths = models.flatMap((x) => {
     const path = getNormalPath(x)
     const pathArray =
-      path.indexOf("/") > 0 ? path.split("/") : path.length > 0 ? [path] : []
+      path.indexOf("/") > 0 ? path.split("/") : path.length <= 0 ? [path] : []
     const transformed: string[] = pathArray.map((pathElem, index) =>
       getPath(pathArray, index + 1)
killedBy: buildTree tests one node tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

  Array [
    Object {
+     "id": 1000,

[Killed] ArithmeticOperator
simple-viewer/src/utils/TreeTransform.ts:9:26
     const pathArray =
       path.indexOf("/") > 0 ? path.split("/") : path.length > 0 ? [path] : []
     const transformed: string[] = pathArray.map((pathElem, index) =>
-      getPath(pathArray, index + 1)
+      getPath(pathArray, index - 1)
     )
     transformed.push(path + "/" + x.name)
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  4

@@ -1,25 +1,20 @@
  Array [
    Object {

[Killed] ArrowFunction
simple-viewer/src/utils/TreeTransform.ts:14:52
     transformed.push(path + "/" + x.name)
     return transformed
   })
-  const uniquePaths = [...new Set(treePaths)].sort((x, y) => x.localeCompare(y))
+  const uniquePaths = [...new Set(treePaths)].sort(() => undefined)
   const tree: Model[] = uniquePaths.map((path, index) => {
     return {
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

@@ -23,25 +23,25 @@
      "id": 2,
      "name": "Лист2",

[Killed] MethodExpression
simple-viewer/src/utils/TreeTransform.ts:14:23
     transformed.push(path + "/" + x.name)
     return transformed
   })
-  const uniquePaths = [...new Set(treePaths)].sort((x, y) => x.localeCompare(y))
+  const uniquePaths = [...new Set(treePaths)]
   const tree: Model[] = uniquePaths.map((path, index) => {
     return {
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

@@ -23,25 +23,25 @@
      "id": 2,
      "name": "Лист2",

[Killed] BlockStatement
simple-viewer/src/utils/TreeTransform.ts:15:58
     return transformed
   })
   const uniquePaths = [...new Set(treePaths)].sort((x, y) => x.localeCompare(y))
-  const tree: Model[] = uniquePaths.map((path, index) => {
-    return {
-      id: generateId(index),
-      path: getPrevPath(path),
-      name: getName(path),
-    }
-  })
+  const tree: Model[] = uniquePaths.map((path, index) => {})
   models.forEach((model) => {
     const modelPath = getNormalPath(model)
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 25
+ Received  +  5

@@ -1,46 +1,26 @@
  Array [
-   Object {

[Killed] ObjectLiteral
simple-viewer/src/utils/TreeTransform.ts:16:12
   })
   const uniquePaths = [...new Set(treePaths)].sort((x, y) => x.localeCompare(y))
   const tree: Model[] = uniquePaths.map((path, index) => {
-    return {
-      id: generateId(index),
-      path: getPrevPath(path),
-      name: getName(path),
-    }
+    return {}
   })
   models.forEach((model) => {
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 25
+ Received  +  5

@@ -1,46 +1,26 @@
  Array [
-   Object {

[Killed] BlockStatement
simple-viewer/src/utils/TreeTransform.ts:22:29
       name: getName(path),
     }
   })
-  models.forEach((model) => {
-    const modelPath = getNormalPath(model)
-    const index = uniquePaths.indexOf(modelPath + "/" + model.name)
-    model.path = modelPath
-    tree[index] = model
-  })
+  models.forEach((model) => {})
   return tree
 }
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -8,26 +8,26 @@
      "id": 1001,
      "name": "Дочерний",

[Killed] StringLiteral
simple-viewer/src/utils/TreeTransform.ts:24:51
   })
   models.forEach((model) => {
     const modelPath = getNormalPath(model)
-    const index = uniquePaths.indexOf(modelPath + "/" + model.name)
+    const index = uniquePaths.indexOf(modelPath + "" + model.name)
     model.path = modelPath
     tree[index] = model
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -8,26 +8,26 @@
      "id": 1001,
      "name": "Дочерний",

[Killed] MethodExpression
simple-viewer/src/utils/TreeTransform.ts:31:10
   return tree
 }
 const getNormalPath = (model: Model) => {
-  return model.path.trim().startsWith("/")
+  return model.path.trim().endsWith("/")
     ? model.path.trim().substring(1)
     : model.path.trim()
killedBy: incorrect trees tests wrong two node tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,8 +5,8 @@
      "path": "",
    },

[Killed] MethodExpression
simple-viewer/src/utils/TreeTransform.ts:31:10
   return tree
 }
 const getNormalPath = (model: Model) => {
-  return model.path.trim().startsWith("/")
+  return model.path.startsWith("/")
     ? model.path.trim().substring(1)
     : model.path.trim()
killedBy: incorrect trees tests spaces in path two node tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -5,8 +5,8 @@
      "path": "",
    },

[Killed] MethodExpression
simple-viewer/src/utils/TreeTransform.ts:32:7
 }
 const getNormalPath = (model: Model) => {
   return model.path.trim().startsWith("/")
-    ? model.path.trim().substring(1)
+    ? model.path.substring(1)
     : model.path.trim()
 }
killedBy: incorrect trees tests spaces in path two node tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
      "id": 1000,

[Killed] MethodExpression
simple-viewer/src/utils/TreeTransform.ts:32:7
 }
 const getNormalPath = (model: Model) => {
   return model.path.trim().startsWith("/")
-    ? model.path.trim().substring(1)
+    ? model.path.trim()
     : model.path.trim()
 }
killedBy: incorrect trees tests wrong one node tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

  Array [
    Object {
+     "id": 1000,

[Survived] MethodExpression
simple-viewer/src/utils/TreeTransform.ts:33:7
 const getNormalPath = (model: Model) => {
   return model.path.trim().startsWith("/")
     ? model.path.trim().substring(1)
-    : model.path.trim()
+    : model.path
 }
 

[Killed] MethodExpression
simple-viewer/src/utils/TreeTransform.ts:37:10
 }
 
 const getPath = (pathArray: string[], index: number) => {
-  return pathArray.slice(0, index).join("/")
+  return pathArray.join("/")
 }
 
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 12
+ Received  +  2

@@ -1,23 +1,18 @@
  Array [
    Object {

[Killed] BlockStatement
simple-viewer/src/utils/TreeTransform.ts:40:39
   return pathArray.slice(0, index).join("/")
 }
 
-const generateId = (index: number) => {
-  return 1000 + index
-}
+const generateId = (index: number) => {}
 const getName = (path: string) => path.substring(path.lastIndexOf("/") + 1)
 
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,23 +1,23 @@
  Array [
    Object {

[Killed] ArithmeticOperator
simple-viewer/src/utils/TreeTransform.ts:41:10
 }
 
 const generateId = (index: number) => {
-  return 1000 + index
+  return 1000 - index
 }
 const getName = (path: string) => path.substring(path.lastIndexOf("/") + 1)
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

@@ -3,21 +3,21 @@
      "id": 1000,
      "name": "Корень",

[Killed] ArrowFunction
simple-viewer/src/utils/TreeTransform.ts:43:17
 const generateId = (index: number) => {
   return 1000 + index
 }
-const getName = (path: string) => path.substring(path.lastIndexOf("/") + 1)
+const getName = () => undefined
 
 const getPrevPath = (path: string) => path.substring(0, path.lastIndexOf("/"))
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,24 +1,24 @@
  Array [
    Object {

[Killed] ArithmeticOperator
simple-viewer/src/utils/TreeTransform.ts:43:50
 const generateId = (index: number) => {
   return 1000 + index
 }
-const getName = (path: string) => path.substring(path.lastIndexOf("/") + 1)
+const getName = (path: string) => path.substring(path.lastIndexOf("/") - 1)
 
 const getPrevPath = (path: string) => path.substring(0, path.lastIndexOf("/"))
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

@@ -4,21 +4,21 @@
      "name": "Корень",
      "path": "",

[Killed] MethodExpression
simple-viewer/src/utils/TreeTransform.ts:45:39
 }
 const getName = (path: string) => path.substring(path.lastIndexOf("/") + 1)
 
-const getPrevPath = (path: string) => path.substring(0, path.lastIndexOf("/"))
+const getPrevPath = (path: string) => path
 
killedBy: click tests checkbox test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="row1000"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <ul
      class="ul"
      data-testid="modelTree"

[Killed] ArrowFunction
simple-viewer/src/utils/TreeTransform.ts:45:21
 }
 const getName = (path: string) => path.substring(path.lastIndexOf("/") + 1)
 
-const getPrevPath = (path: string) => path.substring(0, path.lastIndexOf("/"))
+const getPrevPath = () => undefined
 
killedBy: buildTree tests simple tree
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

@@ -1,25 +1,25 @@
  Array [
    Object {
