[Killed] BlockStatement
simple-viewer/src/saga/rootSaga.ts:4:37
 import { all, fork } from "redux-saga/effects"
 import attributesLoadSaga from "./loadAttributeDataSaga"
 import modelsLoadSaga from "./loadDataSaga"
-export default function* rootSaga() {
-  yield all([fork(modelsLoadSaga), fork(attributesLoadSaga)])
-}
+export default function* rootSaga() {}
 
killedBy: App render tests render APP test
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="modelTree"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="app"
    >
