[Survived] ObjectLiteral
simple-viewer/src/threejs/ViewStyles.ts:13:3
   { id: ViewStyle.WIREFRAME, name: "Контур" },
   { id: ViewStyle.DOUBLE, name: "Двусторонняя заливка" },
   { id: ViewStyle.SINGLE, name: "Односторонняя заливка" },
-  { id: ViewStyle.POINT, name: "Квадратики" },
+  {},
   { id: ViewStyle.CIRCLE, name: "Точки" },
   { id: ViewStyle.OPACITY, name: "Прозрачность" },

[Survived] ObjectLiteral
simple-viewer/src/threejs/ViewStyles.ts:14:3
   { id: ViewStyle.DOUBLE, name: "Двусторонняя заливка" },
   { id: ViewStyle.SINGLE, name: "Односторонняя заливка" },
   { id: ViewStyle.POINT, name: "Квадратики" },
-  { id: ViewStyle.CIRCLE, name: "Точки" },
+  {},
   { id: ViewStyle.OPACITY, name: "Прозрачность" },
 ]
